{
  "id": "xsqnvc",
  "text": "No christian in Florida is saying this is God’s wrath for overturning Roe v Wade\nIt’s always so convenient to pick and choose.",
  "timestamp": "2022-10-01 09:10:00",
  "score": 16939,
  "subreddit": "t5_2qh2p",
  "num_children": 188,
  "author": 338225,
  "replies": [
    {
      "id": "iqmvg9l",
      "text": "Hello r/all, Welcome to r/atheism!\n\nPlease read our [Commandments](http://www.reddit.com/r/atheism/wiki/guidelines) and [FAQ](http://www.reddit.com/r/atheism/wiki/FAQ) before commenting. If you follow the rules and act civilly we can avoid a lot of bans. While everyone is welcome here, this sub is intended for atheists to discuss things of interest to us. This means that a wide variety of subjects are on-topic here. This is not a sub about just atheism.\n\nRemember: The mods do not choose which posts get voted up the frontpage. They remove the posts that violate the [Commandments](/r/atheism/w/guidelines); they don't police quality.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/atheism) if you have any questions or concerns.*",
      "timestamp": "2022-10-01 15:37:13",
      "score": 1,
      "num_children": 1,
      "author": 184140,
      "replies": [
        {
          "id": "iqmyvsm",
          "text": "Nn23 2",
          "timestamp": "2022-10-01 16:01:52",
          "score": -1,
          "num_children": 0,
          "author": 404944,
          "replies": []
        }
      ]
    },
    {
      "id": "iqlzidg",
      "text": "No, clearly it’s god’s wrath for DeSantis sending those immigrants to Martha’s Vineyard.",
      "timestamp": "2022-10-01 10:49:55",
      "score": 2123,
      "num_children": 20,
      "author": 282407,
      "replies": [
        {
          "id": "iqm1hno",
          "text": "He was just evacuating them from the hurricane! DeSantis cares!",
          "timestamp": "2022-10-01 11:16:27",
          "score": 618,
          "num_children": 3,
          "author": 286151,
          "replies": [
            {
              "id": "iqm4asg",
              "text": "He pulled them from Texas and sent them to Massachusetts.\n\nHe bypassed Florida, while Florida falls a million short of the workers they need for the hospitality industry right now. \n\nI think God's telling people to stay out of Florida.",
              "timestamp": "2022-10-01 11:50:43",
              "score": 354,
              "num_children": 7,
              "author": 126417,
              "replies": [
                {
                  "id": "iqmeftt",
                  "text": "It’s a “biblical” storm, meaning god hates Floridians and wants them all dead.\n\nI’m not happy people in Florida are suffering, but I couldn’t help but laugh at the unintended meaning when I heard someone call it a “biblical” storm.",
                  "timestamp": "2022-10-01 13:27:57",
                  "score": 200,
                  "num_children": 8,
                  "author": 412445,
                  "replies": [
                    {
                      "id": "iqndso1",
                      "text": "Tampa is good Florida, that’s why it only brushed us.",
                      "timestamp": "2022-10-01 17:46:14",
                      "score": 20,
                      "num_children": 1,
                      "author": 295910,
                      "replies": [
                        {
                          "id": "iqomh5w",
                          "text": "https://images.app.goo.gl/y93cLBWRMLWdcx8w6\n\nYep. The only blue county it hit was orlando, so god hates republicans and mickey.",
                          "timestamp": "2022-10-01 23:15:29",
                          "score": 1,
                          "num_children": 0,
                          "author": 285017,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "iqn3rpg",
                      "text": "Yeah I saw those descriptions and most people just think \"big flood/storm\" forgetting God caused it on purpose to kill humanity.",
                      "timestamp": "2022-10-01 16:36:37",
                      "score": 52,
                      "num_children": 2,
                      "author": 351230,
                      "replies": [
                        {
                          "id": "iqp1wnt",
                          "text": "God wasn't killing the \"right\" people , so it's not intentional.... Religious right are such a bunch of kooks",
                          "timestamp": "2022-10-02 01:19:44",
                          "score": 17,
                          "num_children": 1,
                          "author": 194892,
                          "replies": [
                            {
                              "id": "iqq5o9c",
                              "text": "God doesn't prevent terrible things  \nbecause:  \nA) He can't  \nB) He doesn't want to  \nC) He causes them  \nD) He doesn't exist  \nPlease Vote now",
                              "timestamp": "2022-10-02 08:17:32",
                              "score": 7,
                              "num_children": 3,
                              "author": 151834,
                              "replies": [
                                {
                                  "id": "iqr27zw",
                                  "text": "D",
                                  "timestamp": "2022-10-02 14:10:39",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 380600,
                                  "replies": []
                                },
                                {
                                  "id": "iqr29pk",
                                  "text": "D",
                                  "timestamp": "2022-10-02 14:10:59",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 380600,
                                  "replies": []
                                },
                                {
                                  "id": "iqtmu5q",
                                  "text": "Even if He did exist, he obviously doesn't give a damn about life on Earth, supposedly His greatest creations.\n\nImagine calling 911 and hearing the operator say, \"We don't give a damn.  Drop dead!\"  That is the exact equivalent of a god who supposedly exists, but can't be bothered to answer prayers and save victims of the Holocaust, COVID-19 or endless hurricanes. --- Dogbite Williams",
                                  "timestamp": "2022-10-03 00:17:22",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 207075,
                                  "replies": [
                                    {
                                      "id": "iqv7rgm",
                                      "text": "Truth is, NOBODY knows, right? Belief isn’t knowledge. I like Christopher Hitchens’ quote: \n\n”Extraordinary claims, requires extraordinary evidence.”",
                                      "timestamp": "2022-10-03 10:28:55",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 151834,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "iqolu5t",
                          "text": "That god's such an asshole!",
                          "timestamp": "2022-10-01 23:10:28",
                          "score": 13,
                          "num_children": 3,
                          "author": 254853,
                          "replies": [
                            {
                              "id": "iqq3qb4",
                              "text": "Ian was only a little swim meet for MAGA…No big whup!\n\nAmerica’s Christian God",
                              "timestamp": "2022-10-02 07:51:55",
                              "score": 3,
                              "num_children": 0,
                              "author": 151834,
                              "replies": []
                            },
                            {
                              "id": "iqtn0mq",
                              "text": "Worthless piece of shit who can't lift a finger to help those in need.\n\nEven if He did exist, he sure as hell does NOT deserve to be worshipped. --- Dogbite Williams",
                              "timestamp": "2022-10-03 00:18:46",
                              "score": 3,
                              "num_children": 0,
                              "author": 207075,
                              "replies": []
                            },
                            {
                              "id": "iqpf5xb",
                              "text": "[deleted]",
                              "timestamp": "2022-10-02 03:12:11",
                              "score": 0,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "iqpn1xj",
                                  "text": "I don't care what you think :)",
                                  "timestamp": "2022-10-02 04:29:36",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 254853,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "iqmzzda",
                      "text": "Those rich obnoxious conservative Christian Evangelical white boomers deserve it. \n\nUnfortunately they likely got out just fine since they have so much more of the wealth to being with.",
                      "timestamp": "2022-10-01 16:09:40",
                      "score": 57,
                      "num_children": 1,
                      "author": 408587,
                      "replies": [
                        {
                          "id": "iqope7b",
                          "text": "We are not rich - but fairly comfortable, don't think we come across as obnoxious, not conservative, Christian but not evangelical, boomers.\n\nWe don't live in FL but have been snowbirds before covid. Not any longer.\n\nWouldn't move permanently to FL if you paid us. The Gov is a fool pushing hurtful programs and policies. Many - but not all - people we met there were owners of small businesses they had retired from. Knee jerk conservatives that could make your stomach turn.\n\nCouldn't have a conversation with them without the lies and idiocy that the GOP has taken to spouting.\n\nSo - yes - we are boomers but we do have brains that function.",
                          "timestamp": "2022-10-01 23:38:43",
                          "score": 21,
                          "num_children": 2,
                          "author": 48482,
                          "replies": [
                            {
                              "id": "iqpg6tt",
                              "text": "Good for y'all! Yeah, with those sorts of boomers (I got mine, $%#\\^ yours types), there really isn't much you can do since they don't acknowledge that we live in a VERY different world now-post Reaganomics, post endless Middle Eastern War, post Panama Papers income inequality, automation/outsourcing years, etc. There are benefits and drawbacks to the new order, but you cannot solve your drawbacks by blasting your \"neighbor\" instead of helping raise them up. \n\nThe running joke here in the Southeast is that the \"liberal Northerners\" are wrecking us up down here, but if anything, their money is the only thing that has saved us, and like, don't those people tend to be MORE conservative anyway? Curious. \n\n I could honestly see the Midwest becoming the new economic hotspot, ironically enough considering the jokes of the \"rust belt\" and all that, mainly in light of climate change. Hopefully our population will be fully under control by then.",
                              "timestamp": "2022-10-02 03:21:31",
                              "score": 1,
                              "num_children": 0,
                              "author": 408587,
                              "replies": []
                            },
                            {
                              "id": "iqqtl8e",
                              "text": "We're soon-to-be snowbirds and have been looking at property in FL for a few years. I've just assumed for 40+ years that I would retire in Florida (because isn't that what everyone does??). \n\nNow, I just can't. DeSantis is the #1 reason I won't move there. The last couple years (i.e. since COVID) have been eye opening. Between his policies, mass migration of Uber-MAGAs, and locals screeching about \"Florida's *OPEN FOR BUSINESS!!!*\" (So is every other state, Karen; get over yourself.) -- yeah, time to look at other states.",
                              "timestamp": "2022-10-02 13:01:57",
                              "score": 1,
                              "num_children": 1,
                              "author": 290654,
                              "replies": [
                                {
                                  "id": "iqqx71r",
                                  "text": "Great decision!!",
                                  "timestamp": "2022-10-02 13:32:35",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 48482,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "iqp4vu2",
                      "text": "What do they mean by “biblical storm” are the claiming it was prophecy or just the typical “credit everything I observe with my fairytale” type stuff?",
                      "timestamp": "2022-10-02 01:44:25",
                      "score": 5,
                      "num_children": 0,
                      "author": 44296,
                      "replies": []
                    },
                    {
                      "id": "iqqlrnn",
                      "text": "As someone named Ian \n\nI wasn't happy, but I damn sure appreciated the irony that SOMEONE (even if it had to be me) gave Florida a bath.",
                      "timestamp": "2022-10-02 11:44:21",
                      "score": 3,
                      "num_children": 0,
                      "author": 22937,
                      "replies": []
                    },
                    {
                      "id": "iqq3kgc",
                      "text": "How did you like that swim meet I put on for you, MAGA?\n\nAmerica’s Christian God",
                      "timestamp": "2022-10-02 07:49:41",
                      "score": 1,
                      "num_children": 0,
                      "author": 151834,
                      "replies": []
                    },
                    {
                      "id": "iqncymi",
                      "text": "[removed]",
                      "timestamp": "2022-10-01 17:40:29",
                      "score": -19,
                      "num_children": 2,
                      "replies": [
                        {
                          "id": "iqneiqf",
                          "text": "That's not at all what biblical means. We have actual terms for measuring the magnitude of hurricanes and the bible is not a history book.",
                          "timestamp": "2022-10-01 17:51:11",
                          "score": 11,
                          "num_children": 1,
                          "author": 143583,
                          "replies": [
                            {
                              "id": "iqnf3yy",
                              "text": "[removed]",
                              "timestamp": "2022-10-01 17:55:13",
                              "score": -13,
                              "num_children": 2,
                              "replies": [
                                {
                                  "id": "iqnnndz",
                                  "text": "The Bible does contain some historical information.  But that does not make it a \"history book.\"  The gospel authors were telling a story.  The Book of Acts was telling a story.  They did grab some historical facts when they were relevant to their story.  Spiderman comics referenced US Presidents like Obama.  That does not make spiderman comics a historical document.",
                                  "timestamp": "2022-10-01 18:56:14",
                                  "score": 12,
                                  "num_children": 0,
                                  "author": 122319,
                                  "replies": []
                                },
                                {
                                  "id": "iqntij3",
                                  "text": "RaTiOnALe aLOnE ShOuLd pUlL yOu ThRoUgH tHaT\n\nHe says, trying to claim an ancient work of fiction written in the middle east in which storms literally only ever appear as a result of God's wrath contains a level of historical analysis and measures of storm forces in North America that would instead make the term \"biblical storm\" a mere secular categorization\n\nBut I'm not surprised someone dumb enough to believe the Bible is too dumb to understand any nuance beyond \"Big storm! Big storm like one in book!\"",
                                  "timestamp": "2022-10-01 19:39:00",
                                  "score": 6,
                                  "num_children": 0,
                                  "author": 143583,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "iqnmyzw",
                          "text": "It's almost like words have multiple definitions..",
                          "timestamp": "2022-10-01 18:51:17",
                          "score": 3,
                          "num_children": 0,
                          "author": 296593,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "iqpeymg",
                      "text": "God doesn't hate anyone its a storm cause by mother nature",
                      "timestamp": "2022-10-02 03:10:21",
                      "score": -1,
                      "num_children": 0,
                      "author": 348133,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iqmjrid",
                  "text": "Lucky for them, with the hospitality industry in SW FL out of business for the foreseeable future, they don't need nearly as many workers now.",
                  "timestamp": "2022-10-01 14:10:55",
                  "score": 12,
                  "num_children": 1,
                  "author": 340922,
                  "replies": [
                    {
                      "id": "iqopop5",
                      "text": "Mysterious ways, indeed.",
                      "timestamp": "2022-10-01 23:41:00",
                      "score": 1,
                      "num_children": 0,
                      "author": 127239,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iqm7vu7",
                  "text": "I didn’t need hod to tell me that.",
                  "timestamp": "2022-10-01 12:28:21",
                  "score": 10,
                  "num_children": 1,
                  "author": 25811,
                  "replies": [
                    {
                      "id": "iqo4dys",
                      "text": "Hod works in mysterious ways.",
                      "timestamp": "2022-10-01 20:58:15",
                      "score": 7,
                      "num_children": 0,
                      "author": 387285,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iqnwq46",
                  "text": "I mean, it makes it easier to nuke the hurricane if there is less people there",
                  "timestamp": "2022-10-01 20:02:49",
                  "score": 2,
                  "num_children": 0,
                  "author": 291256,
                  "replies": []
                },
                {
                  "id": "iqowzv0",
                  "text": "Pretty much everyone who doesn't live in Florida tells people to stay out of Florida.",
                  "timestamp": "2022-10-02 00:39:37",
                  "score": 2,
                  "num_children": 0,
                  "author": 114629,
                  "replies": []
                },
                {
                  "id": "iqnmg67",
                  "text": "I mean, there are hurricanes in Texas. He’s being cautious by evacuating them early in hurricane season.",
                  "timestamp": "2022-10-01 18:47:28",
                  "score": 1,
                  "num_children": 0,
                  "author": 408889,
                  "replies": []
                },
                {
                  "id": "iqncrre",
                  "text": "[removed]",
                  "timestamp": "2022-10-01 17:39:12",
                  "score": -4,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iqoaxoj",
                      "text": "*migrants",
                      "timestamp": "2022-10-01 21:46:47",
                      "score": 1,
                      "num_children": 0,
                      "author": 253487,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iqpf9tq",
              "text": "Just wait until he gets that federal money.",
              "timestamp": "2022-10-02 03:13:12",
              "score": 3,
              "num_children": 0,
              "author": 79513,
              "replies": []
            },
            {
              "id": "iqnrvn6",
              "text": "But why could I see this actually being a thing he or someone else claims?",
              "timestamp": "2022-10-01 19:26:54",
              "score": 2,
              "num_children": 0,
              "author": 131634,
              "replies": []
            }
          ]
        },
        {
          "id": "iqmm07f",
          "text": "From /u/fsactual\n\n\nDeuteronomy 27:19, \"Cursed be anyone who perverts the justice due to the immigrants\". DeSantis was warned by God, but he thought he knew better and now has cursed his whole state.",
          "timestamp": "2022-10-01 14:27:42",
          "score": 97,
          "num_children": 1,
          "author": 193266,
          "replies": [
            {
              "id": "iqmvteg",
              "text": "My favorite reply to prayer,\nPraying is just you (whoever)  saying that you don't trust God's perfect plan?\nYou (whoever) would like him to change it,?",
              "timestamp": "2022-10-01 15:39:56",
              "score": 44,
              "num_children": 2,
              "author": 186350,
              "replies": [
                {
                  "id": "iqmwxod",
                  "text": "The gods are man’s creation to give answers that they are too afraid to give themselves.",
                  "timestamp": "2022-10-01 15:47:58",
                  "score": 26,
                  "num_children": 1,
                  "author": 74087,
                  "replies": [
                    {
                      "id": "iqnbl9r",
                      "text": "In the beginning, man created gods.....",
                      "timestamp": "2022-10-01 17:31:03",
                      "score": 7,
                      "num_children": 1,
                      "author": 248641,
                      "replies": [
                        {
                          "id": "iqnx6bd",
                          "text": "God creates dinosaurs. God destroys dinosaurs. God creates man. Man destroys God. Man creates dinosaurs.\n\nDinosaurs... eat man, woman inherits the earth",
                          "timestamp": "2022-10-01 20:06:06",
                          "score": 6,
                          "num_children": 3,
                          "author": 50362,
                          "replies": [
                            {
                              "id": "iqo89fi",
                              "text": "Sounds like a good plan to me.",
                              "timestamp": "2022-10-01 21:26:45",
                              "score": 3,
                              "num_children": 0,
                              "author": 248641,
                              "replies": []
                            },
                            {
                              "id": "iqog2sk",
                              "text": "Reality: Dinosaurs exist. Died out. Humans came to be. Humans invented god. Humans made dinosaurs.\n\nDinosaurs hunt humans. Dinos happy and purring.\n\nWait, are these dinosaurs or cats?",
                              "timestamp": "2022-10-01 22:25:53",
                              "score": 0,
                              "num_children": 0,
                              "author": 340142,
                              "replies": []
                            },
                            {
                              "id": "iqogmlc",
                              "text": "Women recreates man to act as obedient child making machines in the form of humanoid autodildos. Man I'm happy with that.",
                              "timestamp": "2022-10-01 22:30:10",
                              "score": 0,
                              "num_children": 0,
                              "author": 309494,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iqogfe8",
                  "text": "No, praying is praying that his will be done, not please get me a mansion, a maid, a golden bidet, diamond shoes, and a bib.",
                  "timestamp": "2022-10-01 22:28:39",
                  "score": 1,
                  "num_children": 0,
                  "author": 81647,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iqms5mz",
          "text": "His own book is very clear about this:  \n  \n“Then he will say to those on his left, ‘Depart from me, you who are cursed, into the eternal fire prepared for the devil and his angels. For I was hungry and you gave me nothing to eat, I was thirsty and you gave me nothing to drink, I was a stranger and you did not invite me in, I needed clothes and you did not clothe me, I was sick and in prison and you did not look after me.'\"  \n  \nYou'd think a good Christian would get the hint.",
          "timestamp": "2022-10-01 15:13:20",
          "score": 41,
          "num_children": 2,
          "author": 22324,
          "replies": [
            {
              "id": "iqmygst",
              "text": "This \"good christian\" you speak of, do they even exist? I have not met one since I was in grade school over 30 years ago and she was looked down on for being christian instead of Mormon in a heavily Mormon city.",
              "timestamp": "2022-10-01 15:58:59",
              "score": 20,
              "num_children": 2,
              "author": 366454,
              "replies": [
                {
                  "id": "iqnev3b",
                  "text": "I've met a couple. You wouldn't know they're Christian unless you ask if they're free on Sundays.",
                  "timestamp": "2022-10-01 17:53:32",
                  "score": 13,
                  "num_children": 0,
                  "author": 185883,
                  "replies": []
                },
                {
                  "id": "iqna69k",
                  "text": "[removed]",
                  "timestamp": "2022-10-01 17:21:07",
                  "score": -7,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "iqnd9je",
                      "text": "All these secrets that powerful people don't want you to know... Just right there on YouTube. It's a grand conspiracy but at least YouTube is holy and pure \n\nJust like you have all the answers it's in this little book. So easy? Just believe every last little part of this manmade book without question. \n\n\nYour willful ignorance is funny to me. You think you are the insightful and educated one because of a conspiracy theory.",
                      "timestamp": "2022-10-01 17:42:33",
                      "score": 8,
                      "num_children": 0,
                      "author": 127617,
                      "replies": []
                    },
                    {
                      "id": "iqnnxb4",
                      "text": ">But i do recommend you check out people who have come out of the Occult, like Mark Passio, and his life story, what he is saying, and what he has been a part of, and i recommend you check out what the music artist Altiyan Childs said in his 5 hour long exposing vid last year.. you can find it all on youtube.\n\nDone. It's obvious nonesense. I don't laugh at you, just feel sad you can be so deluded",
                      "timestamp": "2022-10-01 18:58:13",
                      "score": 3,
                      "num_children": 0,
                      "author": 296593,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iqnbp8c",
              "text": "But that's from a part of the bible that christians don't bother to read. Which is to say that it's from a part of the bible.",
              "timestamp": "2022-10-01 17:31:47",
              "score": 6,
              "num_children": 0,
              "author": 184569,
              "replies": []
            }
          ]
        },
        {
          "id": "iqmoaq4",
          "text": "or for him and 178 (including cruz and rubio) other republicans voting against federal aid for victims of hurricane sandy",
          "timestamp": "2022-10-01 14:44:49",
          "score": 20,
          "num_children": 0,
          "author": 137110,
          "replies": []
        },
        {
          "id": "iqmr2gx",
          "text": "That would actually be perfect. Florida could be Sodom or Gomorrah. Florida turned away people seeking refuge, just like those cities turned away the angels in Genesis.",
          "timestamp": "2022-10-01 15:05:17",
          "score": 10,
          "num_children": 1,
          "author": 183386,
          "replies": [
            {
              "id": "iqni7fk",
              "text": "The men in Soddom and Gamorrah wanted to rape the angels, not ignore or deprive of hospitality them.",
              "timestamp": "2022-10-01 18:16:55",
              "score": 2,
              "num_children": 2,
              "author": 407109,
              "replies": [
                {
                  "id": "iqnmy5f",
                  "text": "You’re absolutely right! My bad. DeSantis did exploit and use them for his cruel, dehumanizing, political bullshit so it still rings true.",
                  "timestamp": "2022-10-01 18:51:07",
                  "score": 1,
                  "num_children": 0,
                  "author": 183386,
                  "replies": []
                },
                {
                  "id": "iqp93jb",
                  "text": "Though that is the takeaway most people get from the story (that rapists are bad therefore God destroys the city of rapists), the story also serves as a parable about how you should treat travelers with hospitality. Lot was the only good man in the city that the angels saved, and the only thing in the story that paints him as a good man is his hospitality and the fact that he'd offer his own virgin daughters as a compromise to protect his guests.",
                  "timestamp": "2022-10-02 02:19:30",
                  "score": 1,
                  "num_children": 0,
                  "author": 86129,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iqmxl4t",
          "text": "I thought it was God's Wrath just for it being Florida.",
          "timestamp": "2022-10-01 15:52:41",
          "score": 4,
          "num_children": 0,
          "author": 148649,
          "replies": []
        },
        {
          "id": "iqmohju",
          "text": "You mean those warm, dry immigrants with a roof over their head?\n\nNice of him to evacuate them to safety.",
          "timestamp": "2022-10-01 14:46:13",
          "score": 8,
          "num_children": 2,
          "author": 294081,
          "replies": [
            {
              "id": "iqms497",
              "text": "Weren't they in Texas? Not even in Florida?",
              "timestamp": "2022-10-01 15:13:03",
              "score": 8,
              "num_children": 1,
              "author": 388522,
              "replies": [
                {
                  "id": "iqmxcow",
                  "text": "Yes, but he said they come to Florida in “onesies and twosies”. His words.",
                  "timestamp": "2022-10-01 15:50:59",
                  "score": 7,
                  "num_children": 0,
                  "author": 218987,
                  "replies": []
                }
              ]
            },
            {
              "id": "iqns8b6",
              "text": "This is a joke right?",
              "timestamp": "2022-10-01 19:29:32",
              "score": 0,
              "num_children": 2,
              "replies": [
                {
                  "id": "iqnxwnv",
                  "text": "I'm sure it's not what he intended, but he did do them a solid.",
                  "timestamp": "2022-10-01 20:11:33",
                  "score": 1,
                  "num_children": 1,
                  "author": 318636,
                  "replies": [
                    {
                      "id": "iqny91b",
                      "text": "Yes, human trafficking what a favor. DeSantis didn't help ***anyone***. The people at Martha's vineyard did.",
                      "timestamp": "2022-10-01 20:14:05",
                      "score": 0,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "iqnz3dj",
                          "text": "Rather than explain how humor works to you, I'm just going to downvote your comment, explain why I downvoted it, and move on. Have a nice weekend.",
                          "timestamp": "2022-10-01 20:20:14",
                          "score": 2,
                          "num_children": 2,
                          "author": 318636,
                          "replies": [
                            {
                              "id": "iqp4ela",
                              "text": "No worries. I've explained it in detail. \n\nLet's see how that explanation is received.",
                              "timestamp": "2022-10-02 01:40:29",
                              "score": 2,
                              "num_children": 0,
                              "author": 294081,
                              "replies": []
                            },
                            {
                              "id": "iqo06n6",
                              "text": "Yes, your lack of humor, so hysterical.\n\nI love it how every unfunny person on this website thinks it's because someone else doesn't get it.",
                              "timestamp": "2022-10-01 20:27:59",
                              "score": -2,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "iqo3r20",
                                  "text": "Okay buddy.",
                                  "timestamp": "2022-10-01 20:53:35",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 318636,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iqp43cu",
                  "text": ">This is a joke right? \n\nIt's illustrating a particular irony in that the intent was to do something negative that turned out to be a positive for the people it was done to. \n\nThat irony is increased by the fact the people it was intended to pander to have themselves suffered a negative event where the 'punishment' imposed on the first group would have in fact benefited them. \n\nThe third aspect of the irony is that the group the action was intended to attack is now the group that the perpetrators are turning to for assistance in dealing with their own situation. \n\nI suppose it's a joke in a sense, although having to spell it out somewhat detracts from its impact.",
                  "timestamp": "2022-10-02 01:37:51",
                  "score": 1,
                  "num_children": 0,
                  "author": 294081,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iqmu1aj",
          "text": "But i like the roe idea too!!",
          "timestamp": "2022-10-01 15:26:55",
          "score": 2,
          "num_children": 0,
          "author": 16523,
          "replies": []
        },
        {
          "id": "iqmj3d7",
          "text": "Its actually just the weather. Now California always burning, maybe you’d have something there.",
          "timestamp": "2022-10-01 14:05:55",
          "score": -4,
          "num_children": 2,
          "replies": [
            {
              "id": "iqmlcxp",
              "text": "Lots of burning bushes in CA.",
              "timestamp": "2022-10-01 14:22:51",
              "score": 6,
              "num_children": 2,
              "author": 398705,
              "replies": [
                {
                  "id": "iqmqdqo",
                  "text": "A little penicillin will clear that right up.",
                  "timestamp": "2022-10-01 15:00:17",
                  "score": 9,
                  "num_children": 1,
                  "author": 315158,
                  "replies": [
                    {
                      "id": "iqnq96s",
                      "text": "There's a cream for the topical burning.",
                      "timestamp": "2022-10-01 19:15:06",
                      "score": 1,
                      "num_children": 0,
                      "author": 30695,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iqnhw7k",
                  "text": "Unfortunately, W isn't one of them.",
                  "timestamp": "2022-10-01 18:14:40",
                  "score": 1,
                  "num_children": 0,
                  "author": 365647,
                  "replies": []
                }
              ]
            },
            {
              "id": "iqmmno5",
              "text": "That's just the Jewish space laser.",
              "timestamp": "2022-10-01 14:32:38",
              "score": 3,
              "num_children": 1,
              "author": 363699,
              "replies": [
                {
                  "id": "iqmum0t",
                  "text": "Robocop The orbiting \"Peace Platform Space Laser has misfired into the hills of South California killing 113 including two former presidents..  tragic.  Now in other news\" https://youtu.be/OEYoY3NwF24",
                  "timestamp": "2022-10-01 15:31:11",
                  "score": 5,
                  "num_children": 0,
                  "author": 266642,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iqn8blp",
          "text": "No. This is god Aborting Florida.",
          "timestamp": "2022-10-01 17:08:16",
          "score": 1,
          "num_children": 0,
          "author": 134687,
          "replies": []
        },
        {
          "id": "iqndqmt",
          "text": "Hit a blood red part of Florida too instead of super blue Tampa.",
          "timestamp": "2022-10-01 17:45:51",
          "score": 1,
          "num_children": 0,
          "author": 241940,
          "replies": []
        },
        {
          "id": "iqnezu0",
          "text": "I would say it is likely god’s wrath for the way theyve been tormenting the LGBT community.",
          "timestamp": "2022-10-01 17:54:25",
          "score": 1,
          "num_children": 0,
          "author": 172260,
          "replies": []
        },
        {
          "id": "iqnlrf2",
          "text": "I'm pretty sure it's God's wrath for burning all those dead dinosaurs.",
          "timestamp": "2022-10-01 18:42:33",
          "score": 1,
          "num_children": 0,
          "author": 329324,
          "replies": []
        },
        {
          "id": "iqo14n8",
          "text": "real talk, republicans deny hospitality to desperate, hungry CHRISTIAN families from south of the border. very christ-like of them.",
          "timestamp": "2022-10-01 20:34:48",
          "score": 1,
          "num_children": 0,
          "author": 97884,
          "replies": []
        },
        {
          "id": "iqojt66",
          "text": "It's God's wrath for voting DeSantis to the governorship in the first place.",
          "timestamp": "2022-10-01 22:54:46",
          "score": 1,
          "num_children": 0,
          "author": 48482,
          "replies": []
        },
        {
          "id": "iqp6pr1",
          "text": "I also think wrath for Lee County for being named after that fuck.",
          "timestamp": "2022-10-02 01:59:40",
          "score": 1,
          "num_children": 0,
          "author": 191655,
          "replies": []
        },
        {
          "id": "iqpwp6d",
          "text": "Martha's Vinyard should send a plane with 50 disaster relief volunteers.",
          "timestamp": "2022-10-02 06:22:03",
          "score": 1,
          "num_children": 0,
          "author": 376884,
          "replies": []
        },
        {
          "id": "iqq6n1h",
          "text": "Poor rich people who voted for this immigration policy.....I feel for them.",
          "timestamp": "2022-10-02 08:30:14",
          "score": 1,
          "num_children": 0,
          "author": 371959,
          "replies": []
        },
        {
          "id": "iqmyclv",
          "text": "[removed]",
          "timestamp": "2022-10-01 15:58:10",
          "score": -1,
          "num_children": 1,
          "replies": [
            {
              "id": "iqn11vx",
              "text": "The issue is that the people lied to about where they were going, and what would happen, and nobody in Massachusetts was notified of their arrival. They were just dumped without warning or preparation as a stunt.",
              "timestamp": "2022-10-01 16:17:22",
              "score": 1,
              "num_children": 0,
              "author": 282407,
              "replies": []
            }
          ]
        },
        {
          "id": "iqp4m08",
          "text": "EXACTLY WHAT I WAS THINKING!!!",
          "timestamp": "2022-10-02 01:42:09",
          "score": 0,
          "num_children": 0,
          "author": 89626,
          "replies": []
        }
      ]
    },
    {
      "id": "iqm8cjy",
      "text": "Na instead they are saying Biden and Clinton used a weather creating device to punish DeSantis, \n\nBecause when nature strikes and Christians cant justify it, suddenly it becomes a manmade disaster.",
      "timestamp": "2022-10-01 12:33:03",
      "score": 258,
      "num_children": 4,
      "author": 321453,
      "replies": [
        {
          "id": "iqmgztt",
          "text": "It was the Jewish space lasers. Duh.",
          "timestamp": "2022-10-01 13:49:18",
          "score": 64,
          "num_children": 2,
          "author": 361182,
          "replies": [
            {
              "id": "iqmpfr6",
              "text": "Jewish space laser heated up the gulf which increased the strength of the hurricane.",
              "timestamp": "2022-10-01 14:53:17",
              "score": 16,
              "num_children": 0,
              "author": 213462,
              "replies": []
            },
            {
              "id": "iqoymgr",
              "text": "What if God *is* the Jewish space laser? My people are reclaiming our Old Testament superpowers.",
              "timestamp": "2022-10-02 00:52:44",
              "score": 2,
              "num_children": 0,
              "author": 252478,
              "replies": []
            }
          ]
        },
        {
          "id": "iqobgmw",
          "text": "There is a very level headed argument for how it is manmade but boy do the conservatives not like to admit it.",
          "timestamp": "2022-10-01 21:50:39",
          "score": 13,
          "num_children": 0,
          "author": 338434,
          "replies": []
        },
        {
          "id": "iqnh9lu",
          "text": "Wait did they actually?",
          "timestamp": "2022-10-01 18:10:10",
          "score": 3,
          "num_children": 2,
          "author": 118391,
          "replies": [
            {
              "id": "iqnhu0k",
              "text": "The Qanon fanatics are. I'm not gonna say all Republicans think this because that wouldn't be fair to them, but there are certainly some who are saying this.\n\nThe scary part is that Marjorie Greene Taylor is one of the people saying this... she quite directly insinuated that there are \"giant lazers in space\" that democrats use to push their agenda, and then she connected it to jews somehow, and now there is a \"Giant Jewish Death Lazer\" meme everywhere. But now Q says they started the hurricane with it.\n\nYes, an elected official is this dumb, and yes, she successfully says so much dumb shit that nobody believes it anymore.",
              "timestamp": "2022-10-01 18:14:13",
              "score": 22,
              "num_children": 2,
              "author": 321453,
              "replies": [
                {
                  "id": "iqo4n4s",
                  "text": "> Marjorie ~~Greene~~ Taylor\n\nI thinks she's just Marge Taylor now.",
                  "timestamp": "2022-10-01 21:00:08",
                  "score": 4,
                  "num_children": 1,
                  "author": 387285,
                  "replies": [
                    {
                      "id": "iqo5k4w",
                      "text": "Ohhhhhh lol I love that! \n\nI didn't even realize!",
                      "timestamp": "2022-10-01 21:06:47",
                      "score": 1,
                      "num_children": 1,
                      "author": 321453,
                      "replies": [
                        {
                          "id": "iqoaduv",
                          "text": "Hope she enjoys that Greene New Deal. *zing!*\n\n&nbsp;          \nAnd Magic the Gathering fans rejoice. Now she's just… MT. (it just writes itself!)",
                          "timestamp": "2022-10-01 21:42:44",
                          "score": 2,
                          "num_children": 0,
                          "author": 136415,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iqo85gy",
                  "text": "Do you happen to have any links? Theres a guy at my work who told me weather machines created the hurricane.",
                  "timestamp": "2022-10-01 21:25:56",
                  "score": 1,
                  "num_children": 0,
                  "author": 31328,
                  "replies": []
                }
              ]
            },
            {
              "id": "iqo8m3v",
              "text": "They’ve done it since 2012. [link](https://www.usnews.com/news/blogs/washington-whispers/2012/10/29/conspiracy-theorists-say-obama-engineered-hurricane-sandy)",
              "timestamp": "2022-10-01 21:29:25",
              "score": 1,
              "num_children": 0,
              "author": 329768,
              "replies": []
            }
          ]
        },
        {
          "id": "iqopkai",
          "text": "Surprised they aren't saying it's because we haven't overturned Obergefell too.",
          "timestamp": "2022-10-01 23:40:03",
          "score": 1,
          "num_children": 0,
          "author": 51113,
          "replies": []
        }
      ]
    },
    {
      "id": "iqmih6v",
      "text": "When DeSantis took the \"Christ\" out of Christian, you're left with Ian.",
      "timestamp": "2022-10-01 14:01:11",
      "score": 140,
      "num_children": 3,
      "author": 271864,
      "replies": [
        {
          "id": "iqmwqpn",
          "text": "Good one!",
          "timestamp": "2022-10-01 15:46:34",
          "score": 21,
          "num_children": 0,
          "author": 357735,
          "replies": []
        },
        {
          "id": "iqukl50",
          "text": "I liked the part where DeSantis said, \"it's ian time\", before he ian'd all over the place, truly one of the moments of all time.",
          "timestamp": "2022-10-03 05:04:51",
          "score": 3,
          "num_children": 0,
          "author": 308737,
          "replies": []
        },
        {
          "id": "iqpwvf6",
          "text": "Dammit!",
          "timestamp": "2022-10-02 06:24:16",
          "score": 2,
          "num_children": 0,
          "author": 231210,
          "replies": []
        }
      ]
    },
    {
      "id": "iqma484",
      "text": "The body has a way of rejecting hurricanes",
      "timestamp": "2022-10-01 12:49:58",
      "score": 89,
      "num_children": 3,
      "author": 31736,
      "replies": [
        {
          "id": "iqmpw99",
          "text": "If it's a legitimate hurricane.",
          "timestamp": "2022-10-01 14:56:41",
          "score": 44,
          "num_children": 0,
          "author": 319741,
          "replies": []
        },
        {
          "id": "iqmu8ey",
          "text": "I wonder why they didn't just shut that whole thing down...",
          "timestamp": "2022-10-01 15:28:22",
          "score": 17,
          "num_children": 0,
          "author": 216152,
          "replies": []
        },
        {
          "id": "iqmugx1",
          "text": "I’m actually a virgo, the hurricane legally can’t kill me this month",
          "timestamp": "2022-10-01 15:30:09",
          "score": 3,
          "num_children": 0,
          "author": 53079,
          "replies": []
        }
      ]
    },
    {
      "id": "iqlystr",
      "text": "Are they asking for \"thoughts and prayers\" as well?!!",
      "timestamp": "2022-10-01 10:40:11",
      "score": 273,
      "num_children": 6,
      "author": 213833,
      "replies": [
        {
          "id": "iqm4uey",
          "text": "Yes definitely.  I live in Tampa and we were in the center of the cone when it turned to the right and annihilated SW Florida instead.  My Texas in laws then proclaimed “prayers answered!” on FB (they prayed we would be spared) then also later offered “prayers for Florida devastation” in another post.  He he I am always amused at Christian logic.",
          "timestamp": "2022-10-01 11:56:45",
          "score": 199,
          "num_children": 8,
          "author": 119302,
          "replies": [
            {
              "id": "iqmew3n",
              "text": "Prayers answered? Was this the prayer?\n\nIn-laws: “Dear god, instead of this hurricane killing my family, please make it kill other families and ruin other lives.”\n\nGod: “Hell yes, why is everyone else asking me to protect everyone?”",
              "timestamp": "2022-10-01 13:31:51",
              "score": 142,
              "num_children": 6,
              "author": 412445,
              "replies": [
                {
                  "id": "iqms44x",
                  "text": "Clearly the people of Tampa prayed harder than the people of Fort Meyers  Beach. So god had no choice but to destroy Fort Meyers Beach. Just like with a football game. One side always prays harder than the other so that determines who god appoints the winner. /s",
                  "timestamp": "2022-10-01 15:13:02",
                  "score": 45,
                  "num_children": 1,
                  "author": 178280,
                  "replies": [
                    {
                      "id": "iqmzun5",
                      "text": "Clearly the good girls of Tampa had fewer abortions! /s",
                      "timestamp": "2022-10-01 16:08:44",
                      "score": 14,
                      "num_children": 2,
                      "author": 213981,
                      "replies": [
                        {
                          "id": "iqomv7c",
                          "text": "I know a few women in Tampa, and man that comment gave me a good laugh.  Thank you, kind stranger.",
                          "timestamp": "2022-10-01 23:18:38",
                          "score": 3,
                          "num_children": 0,
                          "author": 285017,
                          "replies": []
                        },
                        {
                          "id": "iqp6b6c",
                          "text": "So good they're Golden!",
                          "timestamp": "2022-10-02 01:56:13",
                          "score": 1,
                          "num_children": 0,
                          "author": 228605,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iqmgl66",
                  "text": "Yeah I could not believe they claimed god answered their prayers after 50 miles of FL were erased by the hurricane.  I just smh at the utter lack of even basic logic.",
                  "timestamp": "2022-10-01 13:45:59",
                  "score": 43,
                  "num_children": 1,
                  "author": 119302,
                  "replies": [
                    {
                      "id": "iqp95np",
                      "text": "Because for all of their Christian babbling about \"loving your neighbor\", they truly only care about themselves. If they don't know you, fuck you.",
                      "timestamp": "2022-10-02 02:20:01",
                      "score": 3,
                      "num_children": 0,
                      "author": 401846,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iqmtr73",
                  "text": "Zero sum thinking... *Someone* has to be killed by the hurricane to settle the score with god. No way humans can affect something as big as \"the climate\" /s\n\nBtw the atmosphere is shockingly thin compared to the size of earth",
                  "timestamp": "2022-10-01 15:24:50",
                  "score": 10,
                  "num_children": 1,
                  "author": 378111,
                  "replies": [
                    {
                      "id": "iqomxb5",
                      "text": "As long as someone else is suffering more they came out ahead.",
                      "timestamp": "2022-10-01 23:19:05",
                      "score": 1,
                      "num_children": 1,
                      "author": 280739,
                      "replies": [
                        {
                          "id": "iqp8all",
                          "text": "Just like Jesus taught",
                          "timestamp": "2022-10-02 02:12:47",
                          "score": 2,
                          "num_children": 0,
                          "author": 373083,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iqnb24o",
                  "text": "The god of the Bible is pretty clearly evil. He’s basically Donald Trump. Petty, vain, childish, needs constant praise. In fact the only unforgivable sin is to deny you believe in him. That’s the most Trumpian thing I’ve ever heard.",
                  "timestamp": "2022-10-01 17:27:19",
                  "score": 10,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iqnfrsv",
                      "text": "Yeah the unforgivable sin is obviously an authoritarian tactic to prevent people from questioning obvious bullshit.\n\nIf God is real (and I believe in God just not the simplistic Christian one) then a little bit of questioning isnt going to be an issue because truth will always lead you back to the real God and away from false ones. Like it's absurd to think anything else. Evil asks you to believe in it without understanding, asks you to believe despite it feeling wrong. Truth does not, truth stands there shining on a hill regardless of whether you believe it or not. It's like the simplistic exercise of finding who speaks for God and who speaks for evil, who asks you to think and who asks you to believe. It's why I think Jesus was a composite character because at some point he asks us to think, like when he says the bit about two commandments or mote in the eye, we aren't asked to take these lessons on faith because they make sense and can be seen to be rooted in truth, but then at a later point Jesus goes all \"I am the way none come to the Father except through me\" and it's like mmm ok dude that sounds like an asshole talking again, where was the earlier guy who spoke a bunch of plain sense and didn't make it about putting aside that sense!!\n\n\nSorry I got a bit long winded but the point is that only evil would come up with something like the unforgivable sin. (And by evil I don't mean some universal evil like the devil, which does not exist, but simply the vain pettyness of man willing to lie and manipulate others for personal gain)",
                      "timestamp": "2022-10-01 17:59:51",
                      "score": 3,
                      "num_children": 1,
                      "author": 127617,
                      "replies": [
                        {
                          "id": "iqnj0ku",
                          "text": "100%. The one example I always point to is Eve and the fruit of the tree of the knowledge of good and evil. What sort of “good guy” wouldn’t want you to be able to distinguish between good and evil? More curiously, why would satan want you to be able to tell? Wouldn’t it be far easier to manipulate and trick a person who *couldnt* tell right from wrong? The only reason God notices anything is up is because Eve starts covering her genitals when talking to god and god flips out and ejects them from paradise. What kind of incel shit is that?",
                          "timestamp": "2022-10-01 18:22:39",
                          "score": 3,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "iqnuvio",
                              "text": "And why wouldn’t god speak with Eve directly about it?",
                              "timestamp": "2022-10-01 19:49:04",
                              "score": 2,
                              "num_children": 0,
                              "author": 412445,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iqmsi1b",
                  "text": "They probably think it's only us heathens who die since no one prayed for us to live.",
                  "timestamp": "2022-10-01 15:15:49",
                  "score": 2,
                  "num_children": 0,
                  "author": 120187,
                  "replies": []
                },
                {
                  "id": "iqobrxk",
                  "text": "Literally, that's how it always works. Even as a kid the whole \"there but for the grace of god\" thing always made me uncomfortable. Like, maybe I'm overthinking this but it sure sounds like you're saying yay, by the grace of god *other* people got annihilated…?   \n     \nThat… doesn't seem right. *None of this seems right.*\n\n&nbsp;         \nOf course by then I knew there was no point asking about it.",
                  "timestamp": "2022-10-01 21:53:02",
                  "score": 1,
                  "num_children": 0,
                  "author": 136415,
                  "replies": []
                }
              ]
            },
            {
              "id": "iqm6fse",
              "text": "It's never about dogless logic but always being like their believing peers. Imagine never-ending peer-pressure and lifelong immaturity.",
              "timestamp": "2022-10-01 12:13:47",
              "score": 26,
              "num_children": 1,
              "author": 213833,
              "replies": [
                {
                  "id": "iqm72uv",
                  "text": "Like eternal high school",
                  "timestamp": "2022-10-01 12:20:25",
                  "score": 10,
                  "num_children": 2,
                  "author": 322642,
                  "replies": [
                    {
                      "id": "iqmqgd7",
                      "text": "No, no. Many, many high schools are much less hateful and violent.",
                      "timestamp": "2022-10-01 15:00:47",
                      "score": 5,
                      "num_children": 0,
                      "author": 17087,
                      "replies": []
                    },
                    {
                      "id": "iqokmaq",
                      "text": "That's exactly what it's like",
                      "timestamp": "2022-10-01 23:01:05",
                      "score": 2,
                      "num_children": 0,
                      "author": 34862,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iqmk87g",
              "text": "saw a Christian presentation once saying \"if miracles aren't real, then why are there stories of disasters where that one person survived in the wreckage?\" and I'm like Bitch! The other 99% died in the disaster! There was no miracle for them.",
              "timestamp": "2022-10-01 14:14:26",
              "score": 27,
              "num_children": 1,
              "author": 308338,
              "replies": [
                {
                  "id": "iqmr73t",
                  "text": "200 people died in a fire but a Bible survived, one of God's miracles",
                  "timestamp": "2022-10-01 15:06:15",
                  "score": 12,
                  "num_children": 1,
                  "author": 122550,
                  "replies": [
                    {
                      "id": "iqmvu5h",
                      "text": "This has a scientific explanation. A closed Bible, especially a leather covered one is one of the more fire resistant things you could find in someone’s home. When you see a photo of a book burning, the books just being strewn about in the fire isn’t just because of a general disrespect for said books. It is because a neat stack of books is really hard to burn because there is no space between the pages for there to be oxygen to fuel the fire.",
                      "timestamp": "2022-10-01 15:40:05",
                      "score": 16,
                      "num_children": 1,
                      "author": 307978,
                      "replies": [
                        {
                          "id": "iqn9o6f",
                          "text": "Damn u take it seriously.",
                          "timestamp": "2022-10-01 17:17:44",
                          "score": 4,
                          "num_children": 1,
                          "author": 120683,
                          "replies": [
                            {
                              "id": "iqnbzm8",
                              "text": "Got a book-burning expert, over here lol",
                              "timestamp": "2022-10-01 17:33:45",
                              "score": 5,
                              "num_children": 0,
                              "author": 316174,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "iqmnk11",
              "text": "Holy shit being grateful is one thing but posting that is so insensitive",
              "timestamp": "2022-10-01 14:39:18",
              "score": 6,
              "num_children": 0,
              "author": 97493,
              "replies": []
            },
            {
              "id": "iqmq6ud",
              "text": "Well god  only answers every 25th prayer dontcha-know!",
              "timestamp": "2022-10-01 14:58:53",
              "score": 3,
              "num_children": 0,
              "author": 211006,
              "replies": []
            },
            {
              "id": "iqmqdhf",
              "text": "I love how the same people stupid enough to be full grown adults and keep believing this shit, are always also the same people that think Facebook is a safe place \"Cause their family is on it\".\n\nI guess it makes sense. After all, these people *love* con men so of course Zack's machine is a sanctuary for them.",
              "timestamp": "2022-10-01 15:00:14",
              "score": 3,
              "num_children": 0,
              "author": 17087,
              "replies": []
            },
            {
              "id": "iqnajv6",
              "text": "Must be the same god who answers prayers for the local football team to win.",
              "timestamp": "2022-10-01 17:23:44",
              "score": 3,
              "num_children": 1,
              "author": 40993,
              "replies": [
                {
                  "id": "iqnd5n7",
                  "text": "Yeah, fuck those kids with cancer. I had to make sure Brett Favre got another touchdown.",
                  "timestamp": "2022-10-01 17:41:49",
                  "score": 5,
                  "num_children": 0,
                  "author": 248641,
                  "replies": []
                }
              ]
            },
            {
              "id": "iqm707f",
              "text": "Logic?",
              "timestamp": "2022-10-01 12:19:43",
              "score": 2,
              "num_children": 0,
              "author": 322642,
              "replies": []
            }
          ]
        },
        {
          "id": "iqmqxt9",
          "text": "The GOP Twitter account actually did say “thoughts and prayers to the people of Florida” while the GOP Congressional delegation, including every single Florida GOPer, voted against aid to Florida. \n\nRepublicans are worse than useless.",
          "timestamp": "2022-10-01 15:04:20",
          "score": 14,
          "num_children": 1,
          "author": 242383,
          "replies": [
            {
              "id": "iqmwnad",
              "text": "Wait gop voted against aid to FL? Lmfaoooo why is this not talked about more",
              "timestamp": "2022-10-01 15:45:52",
              "score": 4,
              "num_children": 0,
              "author": 69896,
              "replies": []
            }
          ]
        },
        {
          "id": "iqm8kqd",
          "text": "Let's give them that instead of taxpayer money in sure their god will come down to help any day now.",
          "timestamp": "2022-10-01 12:35:18",
          "score": 14,
          "num_children": 0,
          "author": 374931,
          "replies": []
        },
        {
          "id": "iqma16y",
          "text": "And FEMA money…",
          "timestamp": "2022-10-01 12:49:12",
          "score": 7,
          "num_children": 1,
          "author": 60606,
          "replies": [
            {
              "id": "iqmbe7g",
              "text": "Fucking hypocrites want to get on the socialism teat right now.",
              "timestamp": "2022-10-01 13:01:18",
              "score": 10,
              "num_children": 0,
              "author": 171105,
              "replies": []
            }
          ]
        },
        {
          "id": "iqmih8g",
          "text": "No they're asking for aid.",
          "timestamp": "2022-10-01 14:01:12",
          "score": 5,
          "num_children": 2,
          "author": 137685,
          "replies": [
            {
              "id": "iqmu0sf",
              "text": "No, it’s even worse for that. GOPers voted _against_ aid for Florida. For their own people.",
              "timestamp": "2022-10-01 15:26:48",
              "score": 7,
              "num_children": 1,
              "author": 242383,
              "replies": [
                {
                  "id": "iqmyx1b",
                  "text": "Probably something about bootstraps",
                  "timestamp": "2022-10-01 16:02:07",
                  "score": 1,
                  "num_children": 1,
                  "author": 290815,
                  "replies": [
                    {
                      "id": "iqndsyn",
                      "text": "No, they have to make sure the bill is written properly. They have to make sure that certain \"woke\" people, like the ones that gave a fictional mermaid darker skin, don't get any help.\n\nIt's what God would want.",
                      "timestamp": "2022-10-01 17:46:17",
                      "score": 3,
                      "num_children": 0,
                      "author": 248641,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iqmkast",
              "text": "Welfare queens",
              "timestamp": "2022-10-01 14:14:59",
              "score": 2,
              "num_children": 0,
              "author": 46457,
              "replies": []
            }
          ]
        },
        {
          "id": "iqoabao",
          "text": "How about \"Noughts and scams\"?",
          "timestamp": "2022-10-01 21:42:12",
          "score": 2,
          "num_children": 0,
          "author": 224902,
          "replies": []
        }
      ]
    },
    {
      "id": "iqmarra",
      "text": "They're also not objecting Biden's 'evil socialist money'.",
      "timestamp": "2022-10-01 12:55:45",
      "score": 54,
      "num_children": 1,
      "author": 213890,
      "replies": [
        {
          "id": "iqpd0sk",
          "text": "Aren't they? Didn't like 13 Republican senators vote no on hurricane relief funds?",
          "timestamp": "2022-10-02 02:52:50",
          "score": 2,
          "num_children": 0,
          "author": 235197,
          "replies": []
        }
      ]
    },
    {
      "id": "iqlw7o6",
      "text": "No you see, this is God displaying his hurricanous wrath at teh gay and teh abortions that are still happening.",
      "timestamp": "2022-10-01 10:03:28",
      "score": 496,
      "num_children": 5,
      "author": 358252,
      "replies": [
        {
          "id": "iqlxjgh",
          "text": "Just their targetting computer is off",
          "timestamp": "2022-10-01 10:22:23",
          "score": 105,
          "num_children": 2,
          "author": 396370,
          "replies": [
            {
              "id": "iqm67rk",
              "text": "God's Gaydar is malfunctioning.",
              "timestamp": "2022-10-01 12:11:23",
              "score": 66,
              "num_children": 3,
              "author": 184410,
              "replies": [
                {
                  "id": "iqm7rk4",
                  "text": "The most homophobic of people and places are the ones with the most gay but sex going on on the low.",
                  "timestamp": "2022-10-01 12:27:07",
                  "score": 28,
                  "num_children": 3,
                  "author": 238509,
                  "replies": [
                    {
                      "id": "iqrqf7x",
                      "text": "I thought it was known that Dog uses lifelong devout gay pedo’s so he/she can vicariously pop some ripe child cherries. They are referred to as priests. \n\nTax the church…",
                      "timestamp": "2022-10-02 16:52:40",
                      "score": 2,
                      "num_children": 0,
                      "author": 224916,
                      "replies": []
                    },
                    {
                      "id": "iqntn33",
                      "text": "It's a fine line between pleasure and shame.",
                      "timestamp": "2022-10-01 19:39:57",
                      "score": 1,
                      "num_children": 0,
                      "author": 352938,
                      "replies": []
                    },
                    {
                      "id": "iqpgf5d",
                      "text": "Also the ones with the most searches for gay porn on google.",
                      "timestamp": "2022-10-02 03:23:36",
                      "score": 1,
                      "num_children": 0,
                      "author": 33521,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iqncw13",
                  "text": "Oh good, I'm not the only one with a broken gaydar",
                  "timestamp": "2022-10-01 17:40:01",
                  "score": 1,
                  "num_children": 0,
                  "author": 155761,
                  "replies": []
                },
                {
                  "id": "iqnmdf9",
                  "text": "Or just needs a better sharpie.",
                  "timestamp": "2022-10-01 18:46:56",
                  "score": 1,
                  "num_children": 0,
                  "author": 258248,
                  "replies": []
                }
              ]
            },
            {
              "id": "iqmzj98",
              "text": "GREAT SHOT GOD THAT WAS ONE IN A MILLION",
              "timestamp": "2022-10-01 16:06:26",
              "score": 8,
              "num_children": 1,
              "author": 364664,
              "replies": [
                {
                  "id": "iqn69ud",
                  "text": "Don’t get cocky, kid.",
                  "timestamp": "2022-10-01 16:53:59",
                  "score": 4,
                  "num_children": 0,
                  "author": 358252,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iqmatvg",
          "text": "Why not hit Miami then?",
          "timestamp": "2022-10-01 12:56:16",
          "score": 16,
          "num_children": 1,
          "author": 165577,
          "replies": [
            {
              "id": "iqmern3",
              "text": "Lol it did seem to avoid the gayest place in Florida",
              "timestamp": "2022-10-01 13:30:47",
              "score": 40,
              "num_children": 0,
              "author": 202184,
              "replies": []
            }
          ]
        },
        {
          "id": "iqmo275",
          "text": "Yeah this clearly isn't god's wrath bc this was WEEKS after the RvW \n\n/s",
          "timestamp": "2022-10-01 14:43:01",
          "score": 2,
          "num_children": 2,
          "author": 7853,
          "replies": [
            {
              "id": "iqmxd2k",
              "text": "well, god had to make a butterfly near the coast of Indonesia flap extra hard on that day to spin up this storm across the planet.",
              "timestamp": "2022-10-01 15:51:03",
              "score": 4,
              "num_children": 0,
              "author": 18250,
              "replies": []
            },
            {
              "id": "iqn9fb3",
              "text": "Well, god is slow to anger. He was giving them time to repent.",
              "timestamp": "2022-10-01 17:15:59",
              "score": 4,
              "num_children": 1,
              "author": 358252,
              "replies": [
                {
                  "id": "iqrqmqk",
                  "text": "I repented like 10 times…  am I in heaven yet?",
                  "timestamp": "2022-10-02 16:54:02",
                  "score": 1,
                  "num_children": 1,
                  "author": 224916,
                  "replies": [
                    {
                      "id": "iqrs1u8",
                      "text": "No, and now you need to be repent of the false belief that repenting 10 times would be enough.",
                      "timestamp": "2022-10-02 17:03:19",
                      "score": 1,
                      "num_children": 0,
                      "author": 358252,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "iqnkzz3",
          "text": "> teh gay\n\nThis hurricane was clearly orchestrated by Big Gay ™️",
          "timestamp": "2022-10-01 18:37:03",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "iqny37k",
          "text": "If they suffer, God is strengthening them; if others suffer, God is punishing them.  There's no getting around that logic.  Their hearts are hardened.   Frogs, first-born, it simply won't matter.",
          "timestamp": "2022-10-01 20:12:53",
          "score": 1,
          "num_children": 0,
          "author": 156980,
          "replies": []
        }
      ]
    },
    {
      "id": "iqmbnml",
      "text": "There was some pastor in the Pacific NW saying that flooding somewhere else was God's punishment against gays. Then his house burned down in massive wildfires. No comment then!",
      "timestamp": "2022-10-01 13:03:36",
      "score": 50,
      "num_children": 1,
      "author": 340128,
      "replies": [
        {
          "id": "iqp86dp",
          "text": "God didn't like his comments and the pastor knew.",
          "timestamp": "2022-10-02 02:11:47",
          "score": 3,
          "num_children": 0,
          "author": 32098,
          "replies": []
        }
      ]
    },
    {
      "id": "iqlz21v",
      "text": "Well, now I know what to comment on Instagram to people bitching about losing their expensive beach homes.",
      "timestamp": "2022-10-01 10:43:41",
      "score": 82,
      "num_children": 1,
      "author": 83575,
      "replies": [
        {
          "id": "iqms3gf",
          "text": "Surely an intellectual who has “done a lot of different stuff” wouldn’t dare do something as ignorant as apply an extremely broad principle to all of your rich Instagram friends suffering loss. No?",
          "timestamp": "2022-10-01 15:12:53",
          "score": -12,
          "num_children": 2,
          "author": 2892,
          "replies": [
            {
              "id": "iqnb7y4",
              "text": "This feels so much like an attempt at a /r/quityourbullshit moment that missed the mark",
              "timestamp": "2022-10-01 17:28:27",
              "score": 7,
              "num_children": 0,
              "author": 400652,
              "replies": []
            },
            {
              "id": "iqouah5",
              "text": "1. They're stupid enough to buy homes there\n2. Some were stupid enough to remain in their homes\n3. They're stupid enough to complain afterward\n4. By no means are any of these people \"my friends\"\n5. Fuck 'em",
              "timestamp": "2022-10-02 00:17:42",
              "score": 4,
              "num_children": 0,
              "author": 83575,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iqlwbhi",
      "text": "wrath for inventing phrase \"nuisance flooding\"",
      "timestamp": "2022-10-01 10:04:57",
      "score": 20,
      "num_children": 0,
      "author": 113212,
      "replies": []
    },
    {
      "id": "iqmaxfb",
      "text": "The hurricane was much closer to the trafficking of migrants from Texas to Martha's Vineyard that DeSantis  pulled. I've tried to encourage a few Christians to blame Desantis for the hurricane. Not sure how well it has gone, but mildly entertaining. \n\n\nDeuteronomy 27:19 “Cursed is anyone who withholds justice from the foreigner, the fatherless or the widow.”",
      "timestamp": "2022-10-01 12:57:08",
      "score": 71,
      "num_children": 1,
      "author": 335588,
      "replies": [
        {
          "id": "iqndvbb",
          "text": "Just tell them that God spared the Democrat cities of Tampa and Miami but obliterated the heavy Republican SW coast",
          "timestamp": "2022-10-01 17:46:44",
          "score": 8,
          "num_children": 0,
          "author": 241940,
          "replies": []
        }
      ]
    },
    {
      "id": "iqmd8m7",
      "text": "Wait till the waters drop a notch and they will double down with how this is god's wrath because they did Not go far enough.\n\n&#x200B;\n\nThere's no arguing with fanaticism. It's like that axiom about arguing with an idiot and getting pulled down to their level but...worse.",
      "timestamp": "2022-10-01 13:17:52",
      "score": 12,
      "num_children": 0,
      "author": 119383,
      "replies": []
    },
    {
      "id": "iqmkyha",
      "text": "Nonono, it's only god's wrath when it hits liberal areas. If it hits conservative areas then it's the deep state using weather tech to punish desantis. Duh.",
      "timestamp": "2022-10-01 14:19:58",
      "score": 12,
      "num_children": 0,
      "author": 398308,
      "replies": []
    },
    {
      "id": "iqm7owk",
      "text": "Oh, you didn't hear? [It's a plot by the Libz](https://www.reddit.com/r/politics/comments/xsbkuh/failed_gop_candidates_say_deep_state_used_weather/) to punish DeSantis or something",
      "timestamp": "2022-10-01 12:26:22",
      "score": 13,
      "num_children": 1,
      "author": 193845,
      "replies": [
        {
          "id": "iqnedcs",
          "text": "It's God punishing Florida for allowing the federal government to raid the Mar-A-Lago home of His Annointed One.",
          "timestamp": "2022-10-01 17:50:09",
          "score": 1,
          "num_children": 0,
          "author": 248641,
          "replies": []
        }
      ]
    },
    {
      "id": "iqmcz22",
      "text": "No, but when MA is hit with residual, and maybe sees minor flooding, THAT will be God’s wrath for all the ‘godless baby killers’.",
      "timestamp": "2022-10-01 13:15:30",
      "score": 8,
      "num_children": 0,
      "author": 310762,
      "replies": []
    },
    {
      "id": "iqmkqmd",
      "text": "I feel really powerful whenever televangelists say natural disasters happen because I fuck dudes. Why would I stop? My dick game is so good people have to evacuate entire cities.",
      "timestamp": "2022-10-01 14:18:21",
      "score": 8,
      "num_children": 1,
      "author": 235680,
      "replies": [
        {
          "id": "iqnerxm",
          "text": "You suck so good it generates storm fronts halfway around the world! \n\nI bow down to your mastery and technique.",
          "timestamp": "2022-10-01 17:52:57",
          "score": 1,
          "num_children": 1,
          "author": 248641,
          "replies": [
            {
              "id": "iqnf9li",
              "text": "I do suck a mean dick",
              "timestamp": "2022-10-01 17:56:19",
              "score": 1,
              "num_children": 1,
              "author": 235680,
              "replies": [
                {
                  "id": "iqngspk",
                  "text": "I will absolutely take your word for it, since you are the one creating hurricanes and all.",
                  "timestamp": "2022-10-01 18:06:48",
                  "score": 1,
                  "num_children": 0,
                  "author": 248641,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iqm8gov",
      "text": "It’s God’s wrath for little Billy from Jacksonville masturbating about a week ago. His parents warned him not to do that shit, but he did it anyway.",
      "timestamp": "2022-10-01 12:34:10",
      "score": 18,
      "num_children": 0,
      "author": 42134,
      "replies": []
    },
    {
      "id": "iqm699f",
      "text": "Or even turning away immigrants.",
      "timestamp": "2022-10-01 12:11:51",
      "score": 6,
      "num_children": 0,
      "author": 372471,
      "replies": []
    },
    {
      "id": "iqmdg5s",
      "text": "Isn't cool when god's thoughts/desires/hatreds always coincide w/their own?",
      "timestamp": "2022-10-01 13:19:43",
      "score": 8,
      "num_children": 0,
      "author": 197249,
      "replies": []
    },
    {
      "id": "iqmhj4y",
      "text": "The whole concept of \"God's Wrath\" is silly. People project reasons for cherry picked natural events based on their own likes and dislikes. If there were an entity capable of creating an at least 96 billion light year environment with trillions of galaxies just by thinking of it, I'm sure if there were aspects of it that did not meet its standard of behavior, it could just delete it and start over.",
      "timestamp": "2022-10-01 13:53:36",
      "score": 5,
      "num_children": 0,
      "author": 311174,
      "replies": []
    },
    {
      "id": "iqmh9cd",
      "text": "Why would they? They think god overturned Roe v Wade for christians. Why would they say it's gods wrath for something that they wanted?",
      "timestamp": "2022-10-01 13:51:28",
      "score": 4,
      "num_children": 1,
      "author": 326434,
      "replies": [
        {
          "id": "iqmx0d9",
          "text": "Yeah but fuck those starving babies in Africa.",
          "timestamp": "2022-10-01 15:48:30",
          "score": 1,
          "num_children": 1,
          "author": 357735,
          "replies": [
            {
              "id": "iqnf3ge",
              "text": "And those kids everywhere with cancer.",
              "timestamp": "2022-10-01 17:55:07",
              "score": 1,
              "num_children": 0,
              "author": 248641,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iqm67jq",
      "text": "I don’t think it’s God’s wrath over Roe, but I do believe it’s a swipe at DeSatan; I’m doubtful that the wicked will even recognize this as a sign to turn away from their ways.",
      "timestamp": "2022-10-01 12:11:19",
      "score": 4,
      "num_children": 3,
      "author": 395216,
      "replies": [
        {
          "id": "iqm7r5y",
          "text": "Ronald DeSantis = Nerd Idols Satan",
          "timestamp": "2022-10-01 12:27:00",
          "score": 4,
          "num_children": 0,
          "author": 133388,
          "replies": []
        },
        {
          "id": "iqmuntc",
          "text": "When a god doesn't actually exist, they get to claim whatever they want. It's their imaginary deity after all.",
          "timestamp": "2022-10-01 15:31:34",
          "score": 3,
          "num_children": 0,
          "author": 216152,
          "replies": []
        },
        {
          "id": "iqmwvwb",
          "text": "Dont call him DeSatan, Satan is one of the good guys.",
          "timestamp": "2022-10-01 15:47:37",
          "score": 2,
          "num_children": 0,
          "author": 357735,
          "replies": []
        }
      ]
    },
    {
      "id": "iqmmvzx",
      "text": "They have pretty simple rules. Anything good happens that is god doing a miracle. Anything bad happens that can be god punishing you, the work of the devil or god testing your faith. It depends on the circumstance but they have all cases covered.",
      "timestamp": "2022-10-01 14:34:22",
      "score": 3,
      "num_children": 0,
      "author": 36987,
      "replies": []
    },
    {
      "id": "iqmtal1",
      "text": "After praying for like 2,000 years, you’d think things would be just a little better, yknow?",
      "timestamp": "2022-10-01 15:21:29",
      "score": 4,
      "num_children": 0,
      "author": 91539,
      "replies": []
    },
    {
      "id": "iqmav7t",
      "text": "I would think it would be for the governor kidnapping and human trafficking immigrants.  But for some reason God never leaves a sticker or post-it note on these natural disasters so we know. Sometimes he tells Pat Robertson, Kat Kerr, Kent Hovind, or Jim Baker, but lately I am beginning to think they just make up shit their followers want to hear.",
      "timestamp": "2022-10-01 12:56:35",
      "score": 13,
      "num_children": 1,
      "author": 122319,
      "replies": [
        {
          "id": "iqnu2za",
          "text": "If that was the case then god would punish ICE, the president, and other governors for doing the exact same thing",
          "timestamp": "2022-10-01 19:43:12",
          "score": 1,
          "num_children": 0,
          "author": 15205,
          "replies": []
        }
      ]
    },
    {
      "id": "iqm8oez",
      "text": "Then I saw this:\n\nhttps://www.reddit.com/r/Fuckthealtright/comments/xshehp/failed_gop_candidates_say_deep_state_used_weather/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
      "timestamp": "2022-10-01 12:36:19",
      "score": 3,
      "num_children": 0,
      "author": 395817,
      "replies": []
    },
    {
      "id": "iqmbag1",
      "text": "Hm. Maybe it takes God 200 years to notice anything. This is God's wrath for the industrial revolution.",
      "timestamp": "2022-10-01 13:00:25",
      "score": 3,
      "num_children": 0,
      "author": 347203,
      "replies": []
    },
    {
      "id": "iqmefup",
      "text": "That is logic my friend.  Logic is something Christian nationalists do not have.",
      "timestamp": "2022-10-01 13:27:57",
      "score": 3,
      "num_children": 0,
      "author": 359372,
      "replies": []
    },
    {
      "id": "iqmnlyp",
      "text": "I figure it was for desantis' human trafficking stunt.",
      "timestamp": "2022-10-01 14:39:41",
      "score": 3,
      "num_children": 0,
      "author": 408494,
      "replies": []
    },
    {
      "id": "iqmtmjg",
      "text": "Of course not. Their imaginary deity has to follow their narrative.",
      "timestamp": "2022-10-01 15:23:53",
      "score": 3,
      "num_children": 0,
      "author": 216152,
      "replies": []
    },
    {
      "id": "iqn7o4n",
      "text": "No, why would they. This is just to finally remove miami from the map.",
      "timestamp": "2022-10-01 17:03:45",
      "score": 3,
      "num_children": 0,
      "author": 26912,
      "replies": []
    },
    {
      "id": "iqnkx43",
      "text": "Christians: \"I'm never wrong and you always are. Blah blah Jesus blah.\"",
      "timestamp": "2022-10-01 18:36:28",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iqnlyre",
      "text": "Well of course.  Pointing fingers is easy, but the morons who say this kind of dumb shit think themselves to be righteous.  So since it's happening to them, logically it can't be Gods wrath at all, because they are righteous.",
      "timestamp": "2022-10-01 18:44:01",
      "score": 3,
      "num_children": 0,
      "author": 105696,
      "replies": []
    },
    {
      "id": "iqnvzv6",
      "text": "I told my roommate the same thing!  God is condemning them :p",
      "timestamp": "2022-10-01 19:57:28",
      "score": 3,
      "num_children": 0,
      "author": 75262,
      "replies": []
    },
    {
      "id": "iqm6miu",
      "text": "Thoughts and prayers. Don't give them a dime.",
      "timestamp": "2022-10-01 12:15:46",
      "score": 7,
      "num_children": 1,
      "author": 6921,
      "replies": [
        {
          "id": "iqmxm42",
          "text": "I would actually vote for Biden for a second term if that's all he did for this disaster. No funding, no medical assistance just a 5 minute address to the country: send your thoughts and prayers to Florida good citizens of America. God will take care of the rest.",
          "timestamp": "2022-10-01 15:52:53",
          "score": 4,
          "num_children": 0,
          "author": 357735,
          "replies": []
        }
      ]
    },
    {
      "id": "iqmeu2d",
      "text": "They would have to have some kind of accountability first, then actually believe in all that shit they have been spewing ..",
      "timestamp": "2022-10-01 13:31:22",
      "score": 2,
      "num_children": 0,
      "author": 14022,
      "replies": []
    },
    {
      "id": "iqmfc68",
      "text": "Might as well look for athletes thanking god when they lose...",
      "timestamp": "2022-10-01 13:35:36",
      "score": 2,
      "num_children": 0,
      "author": 89625,
      "replies": []
    },
    {
      "id": "iqmfilu",
      "text": "damn, god must really love Michigan....     we don't have any \"acts of god\" out here,  maybe a decent tornado every couple years or so 🤔",
      "timestamp": "2022-10-01 13:37:05",
      "score": 2,
      "num_children": 1,
      "author": 367085,
      "replies": [
        {
          "id": "iqn0pwu",
          "text": "Oregon is due for a massive earthquake /tsunami that is predicted to level the western part of the State.  When that happens,  I suspect many Evangelicals and all of the Televangelists will say that we deserved it...",
          "timestamp": "2022-10-01 16:14:58",
          "score": 2,
          "num_children": 1,
          "author": 232438,
          "replies": [
            {
              "id": "iqpfoft",
              "text": "it's clearly because of the acceptance of homosexual behavior.   you guys need to get your act together 🙄",
              "timestamp": "2022-10-02 03:16:52",
              "score": 2,
              "num_children": 0,
              "author": 367085,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iqmijim",
      "text": "Or the fact that Desantis sent all those poor migrants up to Martha's Vineyard. Seems like something a \"christian\" would interpret as punishment for directly going against the teachings of Jesus. I guess that's my bad for assuming these people know anything about the bible.",
      "timestamp": "2022-10-01 14:01:43",
      "score": 2,
      "num_children": 0,
      "author": 121604,
      "replies": []
    },
    {
      "id": "iqmm6ug",
      "text": "Its almost like its all complete bullshit by opportunists looking to take advantage of a situation to further control and exert power over others.",
      "timestamp": "2022-10-01 14:29:06",
      "score": 2,
      "num_children": 0,
      "author": 111858,
      "replies": []
    },
    {
      "id": "iqmm7ie",
      "text": "What? If Christians are going to say that the hurricane is wrath for something, they've never going to say it's for overturning Roe versus Wade.",
      "timestamp": "2022-10-01 14:29:14",
      "score": 2,
      "num_children": 0,
      "author": 294436,
      "replies": []
    },
    {
      "id": "iqmmgj6",
      "text": "Get a sign on a stick and be the change you want to see in the world.",
      "timestamp": "2022-10-01 14:31:08",
      "score": 2,
      "num_children": 0,
      "author": 252400,
      "replies": []
    },
    {
      "id": "iqmptuv",
      "text": "God apparently  hates the south in general. All the hypocrites, make him pissed.",
      "timestamp": "2022-10-01 14:56:11",
      "score": 2,
      "num_children": 0,
      "author": 63135,
      "replies": []
    },
    {
      "id": "iqmtgwv",
      "text": "A few are claiming it’s Biden seeding clouds to make Desantis look bad.",
      "timestamp": "2022-10-01 15:22:46",
      "score": 2,
      "num_children": 0,
      "author": 164708,
      "replies": []
    },
    {
      "id": "iqn4fr0",
      "text": "They’re too busy saying it was a liberal false flag weather machine used to punish DeSantis for not forcing vaccines. Seriously.",
      "timestamp": "2022-10-01 16:41:16",
      "score": 2,
      "num_children": 0,
      "author": 258607,
      "replies": []
    },
    {
      "id": "iqn9nca",
      "text": "Deutoronomy 27:19 ..\"Cursed is anyone who withholds justice from the foreigner/ immigrant, the fatherless or the widow\" ... clearly it was God's Punishment , says so in the Bible for mistreating the immigrants ...\n Of course you will never hear that from Bible thumpers about Florida.  Then again that was old Jesus,  MAGA & Republicans now worship the Orange Jesus.",
      "timestamp": "2022-10-01 17:17:33",
      "score": 2,
      "num_children": 0,
      "author": 150750,
      "replies": []
    },
    {
      "id": "iqnbcah",
      "text": "Feel for all the innocent people caught up in this.  Do not waste your sympathy on hateful religious bigots.  They deserve nothing less",
      "timestamp": "2022-10-01 17:29:18",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iqndkxd",
      "text": "Haha. \nMy thought was this is Karama punishing DeSantis for sending migrants to Martha’s Vineyard. The irony is he saved them, kind of?",
      "timestamp": "2022-10-01 17:44:46",
      "score": 2,
      "num_children": 0,
      "author": 251774,
      "replies": []
    },
    {
      "id": "iqnju3i",
      "text": "Or for trafficking Texas immigrants.",
      "timestamp": "2022-10-01 18:28:35",
      "score": 2,
      "num_children": 0,
      "author": 163175,
      "replies": []
    },
    {
      "id": "iqnpbxq",
      "text": "naw see god is only ever mad at *you*, that's how this whole game is played",
      "timestamp": "2022-10-01 19:08:27",
      "score": 2,
      "num_children": 0,
      "author": 379243,
      "replies": []
    },
    {
      "id": "iqnreqo",
      "text": "This is such an important viewing angle... selective perception is an huge part that makes religion and superstition work in the first place.\n\nCertainly it is something we should all strive for, too understand and beeing able to point out the underlying psychological, biases and otherwise mechanics that are underlying religious beliefs.",
      "timestamp": "2022-10-01 19:23:26",
      "score": 2,
      "num_children": 0,
      "author": 203546,
      "replies": []
    },
    {
      "id": "iqntgy6",
      "text": "No god would never ever punish them, so Jewish space lasers whipped up a hurricane.",
      "timestamp": "2022-10-01 19:38:39",
      "score": 2,
      "num_children": 0,
      "author": 325897,
      "replies": []
    },
    {
      "id": "iqnuxkx",
      "text": "\nIt's all them damn Gays fault.",
      "timestamp": "2022-10-01 19:49:29",
      "score": 2,
      "num_children": 0,
      "author": 220338,
      "replies": []
    },
    {
      "id": "iqnz3n5",
      "text": "We all know this is happening because of all them gays down in Florida",
      "timestamp": "2022-10-01 20:20:17",
      "score": 2,
      "num_children": 0,
      "author": 220414,
      "replies": []
    },
    {
      "id": "iqnzsb5",
      "text": "That doesn’t conveniently fit their narrative so no surprises here.",
      "timestamp": "2022-10-01 20:25:11",
      "score": 2,
      "num_children": 0,
      "author": 16185,
      "replies": []
    },
    {
      "id": "iqo0v5h",
      "text": "This AGN in AZ is saying it",
      "timestamp": "2022-10-01 20:32:54",
      "score": 2,
      "num_children": 0,
      "author": 102347,
      "replies": []
    },
    {
      "id": "iqo20v1",
      "text": "It's so easy to assume to know what god's will is even when they teach us that no one can know. Sounds like a pretty good copout to me",
      "timestamp": "2022-10-01 20:41:17",
      "score": 2,
      "num_children": 0,
      "author": 230120,
      "replies": []
    },
    {
      "id": "iqoa3x4",
      "text": "Oh yeah, if there was a god then this pain and suffering being sent down to god-fearing Floridians couldn't have anything to do with their twisted sense of inherent superiority, nor their insistence of their righteousness, nor their clueless defense of imposing their narrow views on others, no.",
      "timestamp": "2022-10-01 21:40:40",
      "score": 2,
      "num_children": 0,
      "author": 224902,
      "replies": []
    },
    {
      "id": "iqomcme",
      "text": "This hurricane is God's wrath lol",
      "timestamp": "2022-10-01 23:14:28",
      "score": 2,
      "num_children": 0,
      "author": 231263,
      "replies": []
    },
    {
      "id": "iqowooy",
      "text": "The migrant’s got spared because of Desantis.  Poetic.",
      "timestamp": "2022-10-02 00:37:05",
      "score": 2,
      "num_children": 1,
      "author": 282619,
      "replies": [
        {
          "id": "iqplj35",
          "text": "The migrants were in Texas and wouldn't have been affected anyway.  De Santis apparently couldn't find any migrants in Florida.  \n\nEven in Texas, he couldn't find any that were in the country illegally - the people he sent to Massachusetts had permission to be in the US.",
          "timestamp": "2022-10-02 04:13:29",
          "score": 2,
          "num_children": 1,
          "author": 178902,
          "replies": [
            {
              "id": "iqplr24",
              "text": "No shit. He’s a bigger tool than I thought. If you have to go out of your way to prove you’re agenda you’re doing it wrong.",
              "timestamp": "2022-10-02 04:15:47",
              "score": 1,
              "num_children": 0,
              "author": 282619,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iqp72bd",
      "text": "Great. I guess we’re next here in Texas. It’s not our fault we’re represented by idiots that don’t respect women and treat poor immigrants so badly.",
      "timestamp": "2022-10-02 02:02:28",
      "score": 2,
      "num_children": 0,
      "author": 32216,
      "replies": []
    },
    {
      "id": "iqp9ocr",
      "text": "If the legislation was passed in the first place, wouldn't that have been part of God's plan? Or did your God want abortion, then change their mind?",
      "timestamp": "2022-10-02 02:24:17",
      "score": 2,
      "num_children": 0,
      "author": 118350,
      "replies": []
    },
    {
      "id": "iqpijl0",
      "text": "You could say it's God's wrath for us causing climate change and still be quite correct if you tend to call rules of nature the will of God. (MGR:R reference intended)",
      "timestamp": "2022-10-02 03:43:39",
      "score": 2,
      "num_children": 0,
      "author": 127671,
      "replies": []
    },
    {
      "id": "iqpzq0t",
      "text": "I was hoping mar a lago would be destroyed with no loss of life of course. Well maybe one",
      "timestamp": "2022-10-02 07:00:02",
      "score": 2,
      "num_children": 0,
      "author": 154805,
      "replies": []
    },
    {
      "id": "iqq3qy9",
      "text": "DeSantis has further sins to account for, beyond his hypocrisy and his uncharitable actions towards New York and New Jersey, during Superstorm Sandy\n\nHurricane Ian has been called a storm of “Biblical “ proportions. As a Biblical storm, it has been sent by God to punish sinners. \n\nRon Desantis used the wealth of Florida to send away the Texas migrants, Flying them first **from Texas to Florida and then sending them away to Martha’s vineyard.**\n\n**A reading from Matthew beginning at chapter 25, verse 41**\n\n“Then the King will turn to those on the left and say, ‘Away with you, **you cursed ones**, into the eternal fire prepared for the devil and his demons. 42 For **I was hungry, and you didn’t feed me. I was thirsty, and you didn’t give me a drink. 43 I was a stranger, and you didn’t invite me into your home. I was naked, and you didn’t give me clothing. I was sick and in prison, and you didn’t visit me.**’ 44 “Then they will reply, ‘Lord, when did we ever see you hungry or thirsty or a stranger or naked or sick or in prison, and not help you?’ 45 “And he will answer, ‘I tell you the truth, **when you refused to help the least of these my brothers and sisters, you were refusing to help me.**’ 46 “And they will go away into eternal punishment, but the righteous will go into eternal life.”\n\n**The Word of the Lord**",
      "timestamp": "2022-10-02 07:52:09",
      "score": 2,
      "num_children": 0,
      "author": 127239,
      "replies": []
    },
    {
      "id": "iqr2szg",
      "text": "The storm was very real. The bible is pure fiction. Made up to control people.",
      "timestamp": "2022-10-02 14:14:58",
      "score": 2,
      "num_children": 0,
      "author": 380600,
      "replies": []
    },
    {
      "id": "iqmd8c0",
      "text": "[removed]",
      "timestamp": "2022-10-01 13:17:48",
      "score": -11,
      "num_children": 3,
      "replies": [
        {
          "id": "iqmdrpw",
          "text": "[removed]",
          "timestamp": "2022-10-01 13:22:20",
          "score": 22,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "iqmub0a",
          "text": "[removed]",
          "timestamp": "2022-10-01 15:28:56",
          "score": 6,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "iqmwjxo",
          "text": "[removed]",
          "timestamp": "2022-10-01 15:45:12",
          "score": 7,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "iqm4c2q",
      "text": "Its gods wrath for raiding maralago",
      "timestamp": "2022-10-01 11:51:04",
      "score": -5,
      "num_children": 1,
      "author": 55442,
      "replies": [
        {
          "id": "iqo9ie8",
          "text": "He's been busy for a few weeks and couldn't get around to it sooner",
          "timestamp": "2022-10-01 21:36:10",
          "score": 3,
          "num_children": 0,
          "author": 285625,
          "replies": []
        }
      ]
    },
    {
      "id": "iqmd9so",
      "text": "Are you sure?",
      "timestamp": "2022-10-01 13:18:08",
      "score": 1,
      "num_children": 0,
      "author": 246084,
      "replies": []
    },
    {
      "id": "iqmeiny",
      "text": "Pick8ng and choosing is hilarious.  But I mean mostly only radicals think this way.  And I mean it's not just Christianity that has many superstitions theybjust end up being the loudmouth.\n\nI am catholic, very loosely affiliated I believe in things that's a choice don't force it and nothing wrong with atheism no one has to believ3 anything.  Saying that no one should believe the insanity these pushers and radicals put out there.\n\nAlso a woman's body is her fucking body.",
      "timestamp": "2022-10-01 13:28:37",
      "score": 1,
      "num_children": 0,
      "author": 406486,
      "replies": []
    },
    {
      "id": "iqmgswx",
      "text": "But scientists (and actual data) are saying it's Earth's wrath for excessive GHG emissions.",
      "timestamp": "2022-10-01 13:47:44",
      "score": 1,
      "num_children": 0,
      "author": 290082,
      "replies": []
    },
    {
      "id": "iqmhe4n",
      "text": "Not sure how weather and a political event would coincide, yet im not religious so that's probably why I dont understand",
      "timestamp": "2022-10-01 13:52:31",
      "score": 1,
      "num_children": 0,
      "author": 395439,
      "replies": []
    },
    {
      "id": "iqmi7tl",
      "text": "Sure they are. And if you'll write them an insurance policy foso they can rebuild their houses, they promise to keep their big fat fascist mouths shut and never vote again . Oh, no insurance? MAGA, MAGA, MAGA!",
      "timestamp": "2022-10-01 13:59:07",
      "score": 1,
      "num_children": 0,
      "author": 251810,
      "replies": []
    },
    {
      "id": "iqmk6sd",
      "text": "Well, you know, using their usual excuse for natural disasters might make them and their god look bad.",
      "timestamp": "2022-10-01 14:14:09",
      "score": 1,
      "num_children": 0,
      "author": 114194,
      "replies": []
    },
    {
      "id": "iqmld50",
      "text": "See this to me is why religion in itself makes no sense to me. Who are you to know what is and what is not gods will? You have to assume that EVERYTHING that ever happens is gods will. and if it is then you have no way to interfere with it. So you end up with the conclusion \"why give a fuck in the first place\". its just stupid from start to finish",
      "timestamp": "2022-10-01 14:22:54",
      "score": 1,
      "num_children": 0,
      "author": 410713,
      "replies": []
    },
    {
      "id": "iqmlf0b",
      "text": "It’s gods wrath when it happens to other places if it happens to then it’s just bad weather.",
      "timestamp": "2022-10-01 14:23:17",
      "score": 1,
      "num_children": 0,
      "author": 403663,
      "replies": []
    },
    {
      "id": "iqmm037",
      "text": "Exactly.",
      "timestamp": "2022-10-01 14:27:40",
      "score": 1,
      "num_children": 0,
      "author": 9953,
      "replies": []
    },
    {
      "id": "iqmmkyd",
      "text": "I tend to think it's taking the higher ground. (On god appararently.)  It would at least SEEM that people using their whole brain don't make such statements, back.   Remember the Westborough church and their assertion that all straight or otherwise soldiers dying in Iraq was because we had all \"turned America so durned gay.\". In the same way that black folk don't don robes and burn crosses whenever other folk gentrify a neighborhood, it is beneath all of us to hold such self-interested, primitive and limiting views of how the universe works.  Play stupid games, win stupid prizes.  Like a governor who looks and talks like a toddler until suddenly he is underwater, and singing with the boys choir despite \"the rumors\".",
      "timestamp": "2022-10-01 14:32:04",
      "score": 1,
      "num_children": 0,
      "author": 34266,
      "replies": []
    },
    {
      "id": "iqmo78g",
      "text": "All the live youtube feeds were filled with prayers. I was like, don't they think their god controls the weather and sees all? It hurts to think about.",
      "timestamp": "2022-10-01 14:44:04",
      "score": 1,
      "num_children": 0,
      "author": 9416,
      "replies": []
    },
    {
      "id": "iqmora1",
      "text": "Gods wrath for taking the right to choose from half of his creations, obviously.",
      "timestamp": "2022-10-01 14:48:15",
      "score": 1,
      "num_children": 0,
      "author": 338260,
      "replies": []
    },
    {
      "id": "iqmq4x5",
      "text": "Great example. There are endless, yet they see none 😭",
      "timestamp": "2022-10-01 14:58:29",
      "score": 1,
      "num_children": 0,
      "author": 99087,
      "replies": []
    },
    {
      "id": "iqmrye1",
      "text": "What God? the abortion gods wrath?? Stupid point just trying to stir the pot",
      "timestamp": "2022-10-01 15:11:50",
      "score": 1,
      "num_children": 0,
      "author": 24635,
      "replies": []
    },
    {
      "id": "iqmt88p",
      "text": "9 time out of 10, people will pick and choose what works best for them, regardless of the situation.",
      "timestamp": "2022-10-01 15:21:01",
      "score": 1,
      "num_children": 0,
      "author": 354004,
      "replies": []
    },
    {
      "id": "iqmtoy2",
      "text": "Why the hell isn't God sending hurricanes every damn day towards things he disapproves of?",
      "timestamp": "2022-10-01 15:24:22",
      "score": 1,
      "num_children": 1,
      "author": 119062,
      "replies": [
        {
          "id": "iqncwac",
          "text": "For an allegedly omnipotent being, it seems to be awfully constrained by physics.",
          "timestamp": "2022-10-01 17:40:04",
          "score": 2,
          "num_children": 0,
          "author": 306943,
          "replies": []
        }
      ]
    },
    {
      "id": "iqmv4c3",
      "text": "God is testing us . . Or some such bullshit",
      "timestamp": "2022-10-01 15:34:51",
      "score": 1,
      "num_children": 0,
      "author": 410964,
      "replies": []
    },
    {
      "id": "iqmv5jg",
      "text": "Yeah bro God would send his wrath after people chose not to kill babies good one",
      "timestamp": "2022-10-01 15:35:05",
      "score": 1,
      "num_children": 0,
      "author": 14923,
      "replies": []
    },
    {
      "id": "iqmw1qa",
      "text": "Sadly, I have heard horror stories already about karma for “Don’t Say Gay” and the immigrant shipment. \n\nWhen the truth is, the Governor is in Tallahassee- and thus nowhere near where the hurricane hit.",
      "timestamp": "2022-10-01 15:41:37",
      "score": 1,
      "num_children": 0,
      "author": 318470,
      "replies": []
    },
    {
      "id": "iqmw210",
      "text": "It's God's wrath for people building cities in the wrong place.",
      "timestamp": "2022-10-01 15:41:41",
      "score": 1,
      "num_children": 0,
      "author": 205870,
      "replies": []
    },
    {
      "id": "iqmxbqz",
      "text": "Why would they? Typically christians wanted roe overturned, so why would they suffer wrath when it happened? Also I can't agree with any \"wrath\" statements using a typical weather phenomenon. Like how would the east coast get so much wrath when the west coast doesn't?",
      "timestamp": "2022-10-01 15:50:47",
      "score": 1,
      "num_children": 0,
      "author": 210972,
      "replies": []
    },
    {
      "id": "iqmxxag",
      "text": "I’ve been saying that god hates republicans and is smiting them all over.  It’s funny af",
      "timestamp": "2022-10-01 15:55:09",
      "score": 1,
      "num_children": 0,
      "author": 209977,
      "replies": []
    },
    {
      "id": "iqmyjus",
      "text": "Evacuation sure is a convenient way to escape the state. Clearly it's the work of witches pregnant with the Second coming of Jesus.\n\n/s^(omewhat)",
      "timestamp": "2022-10-01 15:59:34",
      "score": 1,
      "num_children": 0,
      "author": 132940,
      "replies": []
    },
    {
      "id": "iqmyngl",
      "text": "If I was on the script writing team, I'd say it's \"satan testing ron DeathSentence.\"",
      "timestamp": "2022-10-01 16:00:16",
      "score": 1,
      "num_children": 0,
      "author": 117993,
      "replies": []
    },
    {
      "id": "iqmz2tc",
      "text": "Everyone knows the Demoncrats created hurricane Ian with laser beams",
      "timestamp": "2022-10-01 16:03:15",
      "score": 1,
      "num_children": 0,
      "author": 323922,
      "replies": []
    },
    {
      "id": "iqmzg40",
      "text": "Well yea, that's because they approve of it. It doesn't fit their format of:\n\"This is God's punishment for [insert thing i dont like]\"",
      "timestamp": "2022-10-01 16:05:50",
      "score": 1,
      "num_children": 0,
      "author": 370580,
      "replies": []
    },
    {
      "id": "iqmzj78",
      "text": "Or denying medicaid coverage for transgender medical care.",
      "timestamp": "2022-10-01 16:06:26",
      "score": 1,
      "num_children": 0,
      "author": 235801,
      "replies": []
    },
    {
      "id": "iqmzjfr",
      "text": "I'll say it then but it won't carry the same weight because I'm not in the club and don't get decide what sky king thinks or doesn't think.",
      "timestamp": "2022-10-01 16:06:29",
      "score": 1,
      "num_children": 0,
      "author": 237620,
      "replies": []
    },
    {
      "id": "iqmzl84",
      "text": "“I distrust those people who know so well what God wants them to do, because I notice it always coincides with their own desires.”",
      "timestamp": "2022-10-01 16:06:50",
      "score": 1,
      "num_children": 0,
      "author": 240669,
      "replies": []
    },
    {
      "id": "iqmzrzl",
      "text": "...but it is! Hahaha, no.",
      "timestamp": "2022-10-01 16:08:12",
      "score": 1,
      "num_children": 0,
      "author": 233674,
      "replies": []
    },
    {
      "id": "iqmzxnh",
      "text": "I think it happened cuz this dude Ian was a fucking little bitch to me 6 years ago. I've been super patient, but at last",
      "timestamp": "2022-10-01 16:09:19",
      "score": 1,
      "num_children": 0,
      "author": 52222,
      "replies": []
    },
    {
      "id": "iqmzzeu",
      "text": "I though hurricanes were God's punishment for letting gay people get married.",
      "timestamp": "2022-10-01 16:09:41",
      "score": 1,
      "num_children": 0,
      "author": 75102,
      "replies": []
    },
    {
      "id": "iqn05vx",
      "text": "That is the Christian gqp,  right, way, pick and choose what part of the bible they can bastardize to fit their Agenda.",
      "timestamp": "2022-10-01 16:10:57",
      "score": 1,
      "num_children": 0,
      "author": 63135,
      "replies": []
    },
    {
      "id": "iqn20am",
      "text": "Just nature reminding us we are insignificant.",
      "timestamp": "2022-10-01 16:24:13",
      "score": 1,
      "num_children": 0,
      "author": 69952,
      "replies": []
    },
    {
      "id": "iqn3871",
      "text": "Mysterious ways.",
      "timestamp": "2022-10-01 16:32:48",
      "score": 1,
      "num_children": 0,
      "author": 57320,
      "replies": []
    },
    {
      "id": "iqn43b6",
      "text": "Or for implementing don't say gay or punishing parents who support their child's gender identity or for removing CRT from their curriculum! By their standards they are a highly Christian state, God should have protected them from that storm! But I'm sure there will be church leaders who will say it was because they didn't go far enough!",
      "timestamp": "2022-10-01 16:38:54",
      "score": 1,
      "num_children": 0,
      "author": 154086,
      "replies": []
    },
    {
      "id": "iqn51fa",
      "text": "More importantly, no atheist is. We don't blame natural phenomena on made up bullshit to further an agenda.",
      "timestamp": "2022-10-01 16:45:26",
      "score": 1,
      "num_children": 1,
      "author": 219095,
      "replies": [
        {
          "id": "iqnb427",
          "text": "No we dont.... but maybe we should start doing that....",
          "timestamp": "2022-10-01 17:27:42",
          "score": 0,
          "num_children": 0,
          "author": 123972,
          "replies": []
        }
      ]
    },
    {
      "id": "iqn57wi",
      "text": "Don’t you mean Christian? Shiiiiit... Roe V. Wade was sorted years ago. And then it wasn’t...",
      "timestamp": "2022-10-01 16:46:42",
      "score": 1,
      "num_children": 0,
      "author": 333533,
      "replies": []
    },
    {
      "id": "iqn889r",
      "text": "Lol cause it wasn't",
      "timestamp": "2022-10-01 17:07:37",
      "score": 1,
      "num_children": 0,
      "author": 265129,
      "replies": []
    },
    {
      "id": "iqn8u6x",
      "text": "Even more on point, no \"christian\" is saying this is god's wrath for sinful Florida...\n\nAmazing the dichotomy these fuckers can dream up.",
      "timestamp": "2022-10-01 17:11:55",
      "score": 1,
      "num_children": 0,
      "author": 366405,
      "replies": []
    },
    {
      "id": "iqn94xy",
      "text": "Because Christians believe overturning it is a good thing",
      "timestamp": "2022-10-01 17:13:59",
      "score": 1,
      "num_children": 0,
      "author": 263661,
      "replies": []
    },
    {
      "id": "iqn9g1q",
      "text": "The Hurricane 🌀 in Florida, there is no God so he/she/it didn't create Hurricane Ian. It is and was the science of climate change 🙄.  Which Christians Nationalists do not believe in it.",
      "timestamp": "2022-10-01 17:16:08",
      "score": 1,
      "num_children": 0,
      "author": 344843,
      "replies": []
    },
    {
      "id": "iqn9ktr",
      "text": "God only does good things now remember? All that wrathful stuff was put aside in the old testament.",
      "timestamp": "2022-10-01 17:17:03",
      "score": 1,
      "num_children": 0,
      "author": 221880,
      "replies": []
    },
    {
      "id": "iqnbc0n",
      "text": "Hes a Republican. They should be happy he didnt go on vacation to Mexico.",
      "timestamp": "2022-10-01 17:29:15",
      "score": 1,
      "num_children": 0,
      "author": 307604,
      "replies": []
    },
    {
      "id": "iqnc4zz",
      "text": "Why would they?",
      "timestamp": "2022-10-01 17:34:47",
      "score": 1,
      "num_children": 0,
      "author": 334558,
      "replies": []
    },
    {
      "id": "iqnduju",
      "text": "Yeah, the extreme weather was supposed to stop once RvW was overturned. It must be the gays /s... \n\nWatch a loooot more christian love will be thrown at the LGBTQ+ community.",
      "timestamp": "2022-10-01 17:46:35",
      "score": 1,
      "num_children": 0,
      "author": 392658,
      "replies": []
    },
    {
      "id": "iqneu7m",
      "text": "So what people do not say is now being held against them?  Smh.",
      "timestamp": "2022-10-01 17:53:22",
      "score": 1,
      "num_children": 0,
      "author": 997,
      "replies": []
    },
    {
      "id": "iqngt8u",
      "text": "They're lucky Trumpass didn't throw them a roll of paper towels!",
      "timestamp": "2022-10-01 18:06:54",
      "score": 1,
      "num_children": 0,
      "author": 314786,
      "replies": []
    },
    {
      "id": "iqnh0ff",
      "text": "That’s because we all know it’s because white Jesus hates Joe Exotic.",
      "timestamp": "2022-10-01 18:08:20",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iqnjiqm",
      "text": "What? Why would they, they support over turning roe v wade",
      "timestamp": "2022-10-01 18:26:20",
      "score": 1,
      "num_children": 0,
      "author": 317136,
      "replies": []
    },
    {
      "id": "iqnl3f1",
      "text": "There should be absolutely no federal aid for FL. Every GOP rep in FL voted against aid for Hurricane Ian relief. Since they are voting against it, they clearly do not want or need our socialist help.\n\nDon't worry. They have plenty of money, and can eve efford things like political stunts that harm individuals.",
      "timestamp": "2022-10-01 18:37:45",
      "score": 1,
      "num_children": 0,
      "author": 60505,
      "replies": []
    },
    {
      "id": "iqnl4ty",
      "text": "Huh? This doesn’t even make sense.",
      "timestamp": "2022-10-01 18:38:02",
      "score": 1,
      "num_children": 0,
      "author": 310373,
      "replies": []
    },
    {
      "id": "iqnlrcj",
      "text": "A woman I work with said that the hurricanes that hit Texas and Florida in the last few years were sent by the Deep State to punish them for supporting Trump. She wasn't kidding. Also, she wears a \"Jesus Freak\" shirt.",
      "timestamp": "2022-10-01 18:42:32",
      "score": 1,
      "num_children": 0,
      "author": 231461,
      "replies": []
    },
    {
      "id": "iqnrcft",
      "text": "It should be ..",
      "timestamp": "2022-10-01 19:22:59",
      "score": 1,
      "num_children": 0,
      "author": 275123,
      "replies": []
    },
    {
      "id": "iqnsh3k",
      "text": "Well now that abortions are over we know that god must have been angry about the gays this whole time. Well, there's always next year.",
      "timestamp": "2022-10-01 19:31:23",
      "score": 1,
      "num_children": 0,
      "author": 195909,
      "replies": []
    },
    {
      "id": "iqo4ffg",
      "text": "God derps in mysterious ways.",
      "timestamp": "2022-10-01 20:58:33",
      "score": 1,
      "num_children": 0,
      "author": 85372,
      "replies": []
    },
    {
      "id": "iqo6wpx",
      "text": "Or that they voted in a racist, homophobic,slob.",
      "timestamp": "2022-10-01 21:16:41",
      "score": 1,
      "num_children": 0,
      "author": 250653,
      "replies": []
    },
    {
      "id": "iqo95b0",
      "text": "Obviously God is right pissed about worshipping the anti-Christ and failing to love their LGBTQ brothers and sisters.",
      "timestamp": "2022-10-01 21:33:32",
      "score": 1,
      "num_children": 0,
      "author": 400965,
      "replies": []
    },
    {
      "id": "iqoa1ey",
      "text": "Funny how that works....",
      "timestamp": "2022-10-01 21:40:09",
      "score": 1,
      "num_children": 0,
      "author": 305461,
      "replies": []
    },
    {
      "id": "iqobbml",
      "text": "and here i thought they were gonna say god was punishing desantis for not hurting liberals ENOUGH!\n\nit’s all good, though, mar-a-lago was completely spared, right?",
      "timestamp": "2022-10-01 21:49:37",
      "score": 1,
      "num_children": 0,
      "author": 253487,
      "replies": []
    },
    {
      "id": "iqofonc",
      "text": "Because it's a hurricane...",
      "timestamp": "2022-10-01 22:22:50",
      "score": 1,
      "num_children": 0,
      "author": 41748,
      "replies": []
    },
    {
      "id": "iqokbfx",
      "text": "This is sublime nature responding to the governor's and the much of the population's refusal to recognise and respond to climate change.\n\nThey will be blaming it on the libs when most of Florida is ocean bottom again.\n\nAnyone with a few functioning brain cells knows that stronger more frequent hurricanes are just one of the features of the warming of the planet. But rednecks and contemporary repuglicans are not noted for great intelligence.",
      "timestamp": "2022-10-01 22:58:46",
      "score": 1,
      "num_children": 0,
      "author": 103531,
      "replies": []
    },
    {
      "id": "iqolqdl",
      "text": "It's god's wrath for Matt Gaetz's face.",
      "timestamp": "2022-10-01 23:09:40",
      "score": 1,
      "num_children": 0,
      "author": 254853,
      "replies": []
    },
    {
      "id": "iqompg0",
      "text": "\"God\" only gets angry for the sins theists came up with. Funny thing. God kind of seems to fit their agenda perfectly.",
      "timestamp": "2022-10-01 23:17:20",
      "score": 1,
      "num_children": 0,
      "author": 49508,
      "replies": []
    },
    {
      "id": "iqooomy",
      "text": "Make new houses floatable.",
      "timestamp": "2022-10-01 23:33:02",
      "score": 1,
      "num_children": 0,
      "author": 8215,
      "replies": []
    },
    {
      "id": "iqoqqfg",
      "text": "They might think if America is forced to become a theocratic hellhole that god will stop pelting them with hurricanes.",
      "timestamp": "2022-10-01 23:49:16",
      "score": 1,
      "num_children": 0,
      "author": 345597,
      "replies": []
    },
    {
      "id": "iqosxl9",
      "text": "Then you say it. Crush their stupid games with the same nonsense they use.",
      "timestamp": "2022-10-02 00:06:41",
      "score": 1,
      "num_children": 0,
      "author": 188650,
      "replies": []
    },
    {
      "id": "iqoueh1",
      "text": "They’ll just blame everyone named Ian or Hurricane.",
      "timestamp": "2022-10-02 00:18:36",
      "score": 1,
      "num_children": 0,
      "author": 260832,
      "replies": []
    },
    {
      "id": "iqov6k7",
      "text": "We should start saying it and see how they like it when we use their words against them",
      "timestamp": "2022-10-02 00:24:52",
      "score": 1,
      "num_children": 0,
      "author": 252582,
      "replies": []
    },
    {
      "id": "iqoz2i5",
      "text": "I’ve noticed a distinct lack of this mega hurricane is God’s Judgment for ____ too",
      "timestamp": "2022-10-02 00:56:21",
      "score": 1,
      "num_children": 0,
      "author": 722,
      "replies": []
    },
    {
      "id": "iqp066p",
      "text": "Because it isn’t?  God isn’t real.",
      "timestamp": "2022-10-02 01:05:23",
      "score": 1,
      "num_children": 0,
      "author": 304605,
      "replies": []
    },
    {
      "id": "iqp1pt7",
      "text": "That is exactly what I thought.    My guess is that SHE is really pissed off.",
      "timestamp": "2022-10-02 01:18:09",
      "score": 1,
      "num_children": 0,
      "author": 76901,
      "replies": []
    },
    {
      "id": "iqp4f2n",
      "text": "It would have been worse if Roe was still in effect. /s",
      "timestamp": "2022-10-02 01:40:35",
      "score": 1,
      "num_children": 0,
      "author": 295411,
      "replies": []
    },
    {
      "id": "iqp65c8",
      "text": "God works in mysterious ways.",
      "timestamp": "2022-10-02 01:54:51",
      "score": 1,
      "num_children": 0,
      "author": 122004,
      "replies": []
    },
    {
      "id": "iqp66ab",
      "text": "If you were a Christian I suppose you would believe God would be happy about the overturning of Roe v Wade hence why no arguments about why it is God’s wrath…maybe. IDK.",
      "timestamp": "2022-10-02 01:55:04",
      "score": 1,
      "num_children": 1,
      "author": 280520,
      "replies": [
        {
          "id": "iqpl6gx",
          "text": "God always hates the same things, and the same people, that his worshipers hate.  It's all very convenient.",
          "timestamp": "2022-10-02 04:09:52",
          "score": 2,
          "num_children": 0,
          "author": 178902,
          "replies": []
        }
      ]
    },
    {
      "id": "iqpa7mv",
      "text": "That hurricane couldn't have hit an ideal state; I can't lie; God did a good thing.",
      "timestamp": "2022-10-02 02:28:45",
      "score": 1,
      "num_children": 0,
      "author": 225565,
      "replies": []
    },
    {
      "id": "iqpbcvi",
      "text": "Maybe it has to do with those refugees, Jesus has words to say about mistreating foreginers.",
      "timestamp": "2022-10-02 02:38:30",
      "score": 1,
      "num_children": 0,
      "author": 286380,
      "replies": []
    },
    {
      "id": "iqpdy69",
      "text": "Climate Change is God's Wrath for Watergate and Gary Webb's assassination.",
      "timestamp": "2022-10-02 03:01:08",
      "score": 1,
      "num_children": 0,
      "author": 369346,
      "replies": []
    },
    {
      "id": "iqpew2c",
      "text": "The Supreme Court overturned Roe, why would God punish Florida for that?",
      "timestamp": "2022-10-02 03:09:41",
      "score": 1,
      "num_children": 1,
      "author": 75856,
      "replies": [
        {
          "id": "iqpn341",
          "text": "Maybe because it was accomplished through dishonest means, God isn't opposed to abortion, and it's all just a big fairy tale for credulous adults anyway.",
          "timestamp": "2022-10-02 04:29:58",
          "score": 1,
          "num_children": 0,
          "author": 318636,
          "replies": []
        }
      ]
    },
    {
      "id": "iqpm1uy",
      "text": "God only sends things that Christians agree with. If you ask them, they'll tell you that's in the Bible.",
      "timestamp": "2022-10-02 04:18:57",
      "score": 1,
      "num_children": 0,
      "author": 101307,
      "replies": []
    },
    {
      "id": "iqpqxio",
      "text": "Or for being racists\nOr for holding up trump like he was Jesus \nOr.. being all in for those who would play with the lives of humans fleeing dangers in their own country for political points of a bunch of mouth breathers.\n\nI wish I had a say in where my tax money goes. I'd send it to Puerto Rico. I'd send it to Jackson Mississippi to fix their drinking water. \n\nFk Florida.  I wouldn't give then a dime",
      "timestamp": "2022-10-02 05:12:25",
      "score": 1,
      "num_children": 0,
      "author": 320085,
      "replies": []
    },
    {
      "id": "iqpwufu",
      "text": "I actually had the same thought, but had been refraining so hard from saying it.",
      "timestamp": "2022-10-02 06:23:54",
      "score": 1,
      "num_children": 0,
      "author": 231210,
      "replies": []
    },
    {
      "id": "iqpy1n8",
      "text": "God sure do act in mysterious ways, don't he? I'm sure this is his way of punishing Disney for their casting of a POC in the role of Ariel in the forthcoming live action version of The Little Mermaid. Seems like as good an issue as any to provoke holy disaster.",
      "timestamp": "2022-10-02 06:39:00",
      "score": 1,
      "num_children": 0,
      "author": 30949,
      "replies": []
    },
    {
      "id": "iqpyvw2",
      "text": "Why would God punish for an anti-abortion move? No Christian is saying this because it wouldn't make sense to start. If Roe was reinstated, that would be a diff story. I don't get what OP means.",
      "timestamp": "2022-10-02 06:49:31",
      "score": 1,
      "num_children": 0,
      "author": 156601,
      "replies": []
    },
    {
      "id": "iqq1nic",
      "text": "That's a bit asinine",
      "timestamp": "2022-10-02 07:24:32",
      "score": 1,
      "num_children": 0,
      "author": 399248,
      "replies": []
    },
    {
      "id": "iqq36bd",
      "text": "Oh, those cherry picking Christian Nationalists, somehow always knowing how the Invisible Man in The Sky, operates.",
      "timestamp": "2022-10-02 07:44:42",
      "score": 1,
      "num_children": 0,
      "author": 151834,
      "replies": []
    },
    {
      "id": "iqq8kzk",
      "text": "Well, I’m that case, Florida seems to always invoke God’s wrath for one reason or another.",
      "timestamp": "2022-10-02 08:56:47",
      "score": 1,
      "num_children": 0,
      "author": 84005,
      "replies": []
    },
    {
      "id": "iqqkduw",
      "text": "This is nature being nature. Nature doesn't give a damn about humans, whether we contaminate the atmosphere and oceans, whatever.  Nature is just going to do its thing, as driven by physics, biology, chemistry. It is called reality.  Of course, we could say Hurricane Ian is a result of Nature's wrath for RELIGION. Frankly, it is quite reassuring that SCIENCE RULES and that there is order to the universe that we're beginning to understand, even if that order includes disorder.",
      "timestamp": "2022-10-02 11:28:13",
      "score": 1,
      "num_children": 0,
      "author": 53932,
      "replies": []
    },
    {
      "id": "iqriset",
      "text": "God don't like the south period. Hypocrites piss Him off.",
      "timestamp": "2022-10-02 16:03:23",
      "score": 1,
      "num_children": 0,
      "author": 332763,
      "replies": []
    },
    {
      "id": "iqmk5yb",
      "text": "Huh?\n\nChristians like the overturning of Roe v Wade, so why would they be saying that?",
      "timestamp": "2022-10-01 14:13:57",
      "score": -22,
      "num_children": 1,
      "author": 195737,
      "replies": [
        {
          "id": "iqmkano",
          "text": "That’s the whole point. Some natural disaster happens but it’s not God’s will.",
          "timestamp": "2022-10-01 14:14:57",
          "score": 26,
          "num_children": 1,
          "author": 338225,
          "replies": [
            {
              "id": "iqmkfqp",
              "text": " No, I think they would say it is God's will but not for the reason you're claiming, because that isn't something about which God would be angered.",
              "timestamp": "2022-10-01 14:16:01",
              "score": -19,
              "num_children": 3,
              "author": 195737,
              "replies": [
                {
                  "id": "iqmugth",
                  "text": "She sure seems pretty pissed off. Did you see the destruction?",
                  "timestamp": "2022-10-01 15:30:08",
                  "score": 11,
                  "num_children": 0,
                  "author": 239397,
                  "replies": []
                },
                {
                  "id": "iqmm1o9",
                  "text": "[removed]",
                  "timestamp": "2022-10-01 14:28:00",
                  "score": 2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iqmoekh",
                      "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n* This comment has been removed for using abusive language, personal attacks, being a dick, or fighting with other users. These activities are against the [rules](https://www.reddit.com/r/atheism/wiki/guidelines).   \r\nConnected comments may also be removed for the same reason, though editing out the direct attack may merit your comment being restored.  Users who don't cease this behavior may get banned temporarily or permanently.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
                      "timestamp": "2022-10-01 14:45:36",
                      "score": 1,
                      "num_children": 0,
                      "author": 122319,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iqrkwqy",
                  "text": "lol, he told you that?",
                  "timestamp": "2022-10-02 16:17:08",
                  "score": 2,
                  "num_children": 0,
                  "author": 2762,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iqmq5p2",
      "text": "It's blessed God's holy will when the weather's good......evil human climate change when its bad.",
      "timestamp": "2022-10-01 14:58:38",
      "score": -11,
      "num_children": 0,
      "author": 16531,
      "replies": []
    },
    {
      "id": "iqn3dtz",
      "text": "Lol",
      "timestamp": "2022-10-01 16:33:54",
      "score": -2,
      "num_children": 0,
      "author": 287136,
      "replies": []
    },
    {
      "id": "iqnqv52",
      "text": "[removed]",
      "timestamp": "2022-10-01 19:19:33",
      "score": -2,
      "num_children": 1,
      "replies": [
        {
          "id": "iqnzpcb",
          "text": "I went to school with a bunch of them",
          "timestamp": "2022-10-01 20:24:35",
          "score": 1,
          "num_children": 0,
          "author": 63465,
          "replies": []
        }
      ]
    },
    {
      "id": "iqmrp63",
      "text": "What? They believe that god hates abortion, why would they think this is God’s wrath for getting rid of it? This makes no sense...",
      "timestamp": "2022-10-01 15:09:57",
      "score": -17,
      "num_children": 1,
      "author": 398931,
      "replies": [
        {
          "id": "iqmwzrp",
          "text": "Because god doesn't hate abortions, doesn't say that anywhere in the Bible. But also, god isn't real anyways.",
          "timestamp": "2022-10-01 15:48:23",
          "score": 14,
          "num_children": 1,
          "author": 338405,
          "replies": [
            {
              "id": "iqns1u5",
              "text": "But that’s what they believe. That’s my point.",
              "timestamp": "2022-10-01 19:28:12",
              "score": 1,
              "num_children": 0,
              "author": 398931,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iqnysjd",
      "text": "Because why would the Christian god punish Christian’s for following Christianity. Just use your brain for a second. If abortion is against Christianity which it is, then why would god punish people for it. I swear people like you just like to speak and have nothing to say",
      "timestamp": "2022-10-01 20:18:04",
      "score": -4,
      "num_children": 3,
      "author": 51510,
      "replies": [
        {
          "id": "iqo5khb",
          "text": "Among all the contradiction in the bible we can find texts in favor of abortion, so who knows what side is god picking now 🤷‍♂️",
          "timestamp": "2022-10-01 21:06:51",
          "score": 3,
          "num_children": 0,
          "author": 34864,
          "replies": []
        },
        {
          "id": "iqrkakk",
          "text": "> If abortion is against Christianity which it is\n\nSource???",
          "timestamp": "2022-10-02 16:13:10",
          "score": 1,
          "num_children": 1,
          "author": 2762,
          "replies": [
            {
              "id": "iqs6k60",
              "text": "[removed]",
              "timestamp": "2022-10-02 18:31:56",
              "score": 1,
              "num_children": 2,
              "replies": [
                {
                  "id": "iqs6sh4",
                  "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n- This comment has been removed for trolling or shitposting. Even if your intent is not to troll or shitpost, certain words and phrases are enough for removal. This rule is applied strictly and may lead to an immediate ban.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
                  "timestamp": "2022-10-02 18:33:22",
                  "score": 1,
                  "num_children": 0,
                  "author": 122319,
                  "replies": []
                },
                {
                  "id": "iqvjena",
                  "text": "By policy, moderators in this sub do not respond to DMs.  All communication must be in the open.\n\nWe are not afraid of debating theists.  You were banned because you repeatedly trolled and proselytized.\n\n/r/atheism is not set up as a debating sub.  We have a lot of people who participate here because it is their only outlet to speak as an atheist.  They have to put up with Christians preaching at them in their daily lives.  They do not want to put up with it here.\n\nIf you want to debate, then I suggest you go to /r/debateanatheist.",
                  "timestamp": "2022-10-03 12:34:18",
                  "score": 1,
                  "num_children": 0,
                  "author": 122319,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iqnzig0",
          "text": "Yeah, the hurricane is God rewarding them for overturning Roe v Wade... The dude is kind of a one trick pony",
          "timestamp": "2022-10-01 20:23:12",
          "score": 0,
          "num_children": 0,
          "author": 63465,
          "replies": []
        }
      ]
    },
    {
      "id": "iqm6pcs",
      "text": "[removed]",
      "timestamp": "2022-10-01 12:16:36",
      "score": -26,
      "num_children": 3,
      "replies": [
        {
          "id": "iqm9e2t",
          "text": "Sorry about your indoctrination.",
          "timestamp": "2022-10-01 12:43:06",
          "score": 12,
          "num_children": 0,
          "author": 196658,
          "replies": []
        },
        {
          "id": "iqmmf5d",
          "text": "lmfao \"left wing extremists\"\n\nimagine actually thinking this, jfc",
          "timestamp": "2022-10-01 14:30:50",
          "score": 7,
          "num_children": 0,
          "author": 391185,
          "replies": []
        },
        {
          "id": "iqm7kr6",
          "text": "Stupid, shitty bad-faith arguments might be the first reason.\n\nA quick glance at your post history might also be a second reason.\n\n\"We're all fucking sick and tired of  explaining to you all to not be afraid of modern medicine like a bunch of goddamned cavemen\" is a third reason.\n\n\"There just aren't many right-wing atheists because modern American conservatism is explicitly a Christofascist death cult\" is a fourth reason.",
          "timestamp": "2022-10-01 12:25:11",
          "score": 27,
          "num_children": 1,
          "author": 123252,
          "replies": [
            {
              "id": "iqm7wpm",
              "text": "[removed]",
              "timestamp": "2022-10-01 12:28:36",
              "score": -19,
              "num_children": 2,
              "replies": [
                {
                  "id": "iqm86qd",
                  "text": "https://youtu.be/2Z4m4lnjxkY",
                  "timestamp": "2022-10-01 12:31:25",
                  "score": 5,
                  "num_children": 0,
                  "author": 193845,
                  "replies": []
                },
                {
                  "id": "iqm82v7",
                  "text": "Fuck out of here, you lame excuse for a troll.",
                  "timestamp": "2022-10-01 12:30:21",
                  "score": 15,
                  "num_children": 1,
                  "author": 123252,
                  "replies": [
                    {
                      "id": "iqm878p",
                      "text": "[removed]",
                      "timestamp": "2022-10-01 12:31:34",
                      "score": -14,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "iqmafuz",
                          "text": "Why is it always \"a cult like Islam\" but never \"a cult like christianity\"?",
                          "timestamp": "2022-10-01 12:52:50",
                          "score": 20,
                          "num_children": 0,
                          "author": 36098,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iqn61en",
      "text": "Is this a joke or are you actually stupid?",
      "timestamp": "2022-10-01 16:52:20",
      "score": -5,
      "num_children": 1,
      "author": 253442,
      "replies": [
        {
          "id": "iqpqmni",
          "text": "Why would you say that?",
          "timestamp": "2022-10-02 05:09:00",
          "score": 1,
          "num_children": 0,
          "author": 67344,
          "replies": []
        }
      ]
    },
    {
      "id": "iqn6hd4",
      "text": "Bro go outside and mind your own business",
      "timestamp": "2022-10-01 16:55:28",
      "score": -6,
      "num_children": 2,
      "author": 61187,
      "replies": [
        {
          "id": "iqqbmjn",
          "text": "Yes, Ron DeSantis really should mind his own business, shouldn't he?",
          "timestamp": "2022-10-02 09:36:49",
          "score": 2,
          "num_children": 0,
          "author": 286151,
          "replies": []
        },
        {
          "id": "iqpqo4c",
          "text": "Are you okay?",
          "timestamp": "2022-10-02 05:09:28",
          "score": 1,
          "num_children": 1,
          "author": 67344,
          "replies": [
            {
              "id": "iqpteyk",
              "text": "[removed]",
              "timestamp": "2022-10-02 05:41:32",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "iqq0lvi",
                  "text": "Thank you for your contribution. Unfortunately, trolling and/or shitposting are not allowed in this subreddit per the [subreddit rules](http://www.reddit.com/r/atheism/wiki/guidelines). \n\nIf you have any questions, please don't hesitate to [contact the moderators](http://www.reddit.com/message/compose?to=%2Fr%2Fatheism). Thank you for your cooperation.",
                  "timestamp": "2022-10-02 07:11:00",
                  "score": 2,
                  "num_children": 0,
                  "author": 318636,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iqniun4",
      "text": "Yeah no shit, they think god doesn’t approve of abortions, logically why would he send wrath for overturning roe v wade?",
      "timestamp": "2022-10-01 18:21:27",
      "score": -6,
      "num_children": 0,
      "author": 173089,
      "replies": []
    },
    {
      "id": "iqpfxtd",
      "text": "probably because God doesn't punish people for not murdering babies but really cool post",
      "timestamp": "2022-10-02 03:19:20",
      "score": -6,
      "num_children": 1,
      "author": 234683,
      "replies": [
        {
          "id": "iqrkpag",
          "text": "babies?",
          "timestamp": "2022-10-02 16:15:49",
          "score": 1,
          "num_children": 0,
          "author": 2762,
          "replies": []
        }
      ]
    },
    {
      "id": "iqn1s3e",
      "text": "Yeah especially when Florida gets hurricanes quite frequently even before that was overturned,  gosh really weird.",
      "timestamp": "2022-10-01 16:22:35",
      "score": -8,
      "num_children": 0,
      "author": 238215,
      "replies": []
    },
    {
      "id": "iqlxyrv",
      "text": "[removed]",
      "timestamp": "2022-10-01 10:28:21",
      "score": -76,
      "num_children": 4,
      "replies": [
        {
          "id": "iqm2djn",
          "text": "Newsflash: abortions never go away.",
          "timestamp": "2022-10-01 11:27:35",
          "score": 38,
          "num_children": 1,
          "author": 300780,
          "replies": [
            {
              "id": "iqm3595",
              "text": "[removed]",
              "timestamp": "2022-10-01 11:37:04",
              "score": -17,
              "num_children": 2,
              "replies": [
                {
                  "id": "iqm6706",
                  "text": "Wish you anti freedom fucks would take a long walk off a short cliff",
                  "timestamp": "2022-10-01 12:11:09",
                  "score": 26,
                  "num_children": 0,
                  "author": 155080,
                  "replies": []
                },
                {
                  "id": "iqm6dzh",
                  "text": "[removed]",
                  "timestamp": "2022-10-01 12:13:15",
                  "score": 13,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "iqmn4e0",
                      "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n* This comment has been removed for using abusive language, personal attacks, being a dick, or fighting with other users. These activities are against the [rules](https://www.reddit.com/r/atheism/wiki/guidelines).   \r\nConnected comments may also be removed for the same reason, though editing out the direct attack may merit your comment being restored.  Users who don't cease this behavior may get banned temporarily or permanently.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
                      "timestamp": "2022-10-01 14:36:04",
                      "score": 1,
                      "num_children": 0,
                      "author": 122319,
                      "replies": []
                    },
                    {
                      "id": "iqm6gg4",
                      "text": "[removed]",
                      "timestamp": "2022-10-01 12:13:59",
                      "score": -5,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "iqm6iwt",
                          "text": "[removed]",
                          "timestamp": "2022-10-01 12:14:43",
                          "score": 19,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "iqm6mw3",
                              "text": "[removed]",
                              "timestamp": "2022-10-01 12:15:53",
                              "score": -1,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "iqm6twy",
                                  "text": "[removed]",
                                  "timestamp": "2022-10-01 12:17:58",
                                  "score": 22,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "iqm77my",
                                      "text": "[removed]",
                                      "timestamp": "2022-10-01 12:21:36",
                                      "score": -1,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "iqm7aqz",
                                          "text": "[removed]",
                                          "timestamp": "2022-10-01 12:22:26",
                                          "score": 12,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "iqm7fgt",
                                              "text": "[removed]",
                                              "timestamp": "2022-10-01 12:23:44",
                                              "score": -1,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "iqm7lws",
                                                  "text": "[removed]",
                                                  "timestamp": "2022-10-01 12:25:31",
                                                  "score": 11,
                                                  "num_children": 1,
                                                  "replies": [
                                                    {
                                                      "id": "iqm7orn",
                                                      "text": "[removed]",
                                                      "timestamp": "2022-10-01 12:26:19",
                                                      "score": -1,
                                                      "num_children": 1,
                                                      "replies": [
                                                        {
                                                          "id": "iqm7zo0",
                                                          "text": "Being anti-choice is oppressive to women. When you turn women into incubators and put lives at risk by not allowing abortions it is oppressing women. When a women has to fear an ectopic pregnancy because it could kill them or a newly pregnant woman gets diagnosed with cancer and has to forgo treatment and ends up dying because they can’t terminate the pregnancy to receive life saving treatment it is oppression.\n\nYou’re a shit libertarian if you’re okay with the government interfering in the medical decisions of a free person.",
                                                          "timestamp": "2022-10-01 12:29:26",
                                                          "score": 9,
                                                          "num_children": 1,
                                                          "author": 155080,
                                                          "replies": [
                                                            {
                                                              "id": "iqm8cyi",
                                                              "text": "[removed]",
                                                              "timestamp": "2022-10-01 12:33:10",
                                                              "score": -1,
                                                              "num_children": 1,
                                                              "replies": [
                                                                {
                                                                  "id": "iqm8jkw",
                                                                  "text": "Why are you claiming to be a libertarian while advocating for the government to impose theological preferences on the citizens of a secular country that interferes with their medical care?",
                                                                  "timestamp": "2022-10-01 12:35:00",
                                                                  "score": 9,
                                                                  "num_children": 1,
                                                                  "author": 155080,
                                                                  "replies": [
                                                                    {
                                                                      "id": "iqm8n7k",
                                                                      "text": "[removed]",
                                                                      "timestamp": "2022-10-01 12:35:59",
                                                                      "score": 0,
                                                                      "num_children": 1,
                                                                      "replies": [
                                                                        {
                                                                          "id": "iqmmr8z",
                                                                          "text": "How about just\n\n> Why are you claiming to be a libertarian while advocating for the government to impose\n\nthen?",
                                                                          "timestamp": "2022-10-01 14:33:24",
                                                                          "score": 1,
                                                                          "num_children": 0,
                                                                          "replies": []
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "iqm5ydy",
          "text": "This guy really thinks abortions will stop. What a turnip.",
          "timestamp": "2022-10-01 12:08:34",
          "score": 19,
          "num_children": 0,
          "author": 268020,
          "replies": []
        },
        {
          "id": "iqm1joz",
          "text": "That's a funny way to say that you want raped women to suffer.",
          "timestamp": "2022-10-01 11:17:11",
          "score": 35,
          "num_children": 1,
          "author": 286151,
          "replies": [
            {
              "id": "iqm32yr",
              "text": "[removed]",
              "timestamp": "2022-10-01 11:36:18",
              "score": -34,
              "num_children": 3,
              "replies": [
                {
                  "id": "iqm5obn",
                  "text": "How about women who you will never know do whatever the fuck they want with their bodies and you shut your uneducated mouth for the rest of your worthless life",
                  "timestamp": "2022-10-01 12:05:34",
                  "score": 29,
                  "num_children": 0,
                  "author": 38183,
                  "replies": []
                },
                {
                  "id": "iqm69qo",
                  "text": "Hey, Random Fella.  This sounds an awfully lot like you are ***not*** one of these 'couples just mingling and fucking.'   I can't imagine even the most desperate of females (or any species) consenting to have sex with you.  \n\nSorry you are such a shit that no one will let you touch her.",
                  "timestamp": "2022-10-01 12:11:59",
                  "score": 17,
                  "num_children": 1,
                  "author": 375852,
                  "replies": [
                    {
                      "id": "iqm6ecj",
                      "text": "[removed]",
                      "timestamp": "2022-10-01 12:13:21",
                      "score": -2,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "iqmg9le",
                          "text": "I don't  believe anything anyone says would convince you abortion should be legal. Why you're here arguing about it is beyond me.  And until you have a sound plan on fixing the foster care and adoption system in america (and globally) you can fuck off. \n\nBecause people like you love to take the moral high ground when it comes to a black and white issue like abortion but have nothing of value to say after the complicated issue of an unwanted child shows up. How are you going to force these people to love and properly care for a child they didn't want? Have you educated yourself on the studies done in regards to neglected and unloved children? Have you followed how critically overwhelmed the foster care system has become? What's your plan to solve that? Add more unwanted children?\n\nYou're teachers handed tests back to you face down alot huh?",
                          "timestamp": "2022-10-01 13:43:20",
                          "score": 8,
                          "num_children": 0,
                          "author": 297462,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iqm3f7x",
                  "text": "Please provide evidence of your claim:\n\n> 99% percent of abortions that are couples just mingling and fucking",
                  "timestamp": "2022-10-01 11:40:25",
                  "score": 29,
                  "num_children": 2,
                  "author": 286151,
                  "replies": [
                    {
                      "id": "iqm3tzi",
                      "text": "[removed]",
                      "timestamp": "2022-10-01 11:45:20",
                      "score": -9,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "iqm5cjw",
                          "text": "Does that also prove your 99% claim?",
                          "timestamp": "2022-10-01 12:02:13",
                          "score": 18,
                          "num_children": 1,
                          "author": 286151,
                          "replies": [
                            {
                              "id": "iqm5zix",
                              "text": "[removed]",
                              "timestamp": "2022-10-01 12:08:54",
                              "score": -6,
                              "num_children": 2,
                              "replies": [
                                {
                                  "id": "iqm66v8",
                                  "text": "I never made a claim. You did. I guess it was a lie.",
                                  "timestamp": "2022-10-01 12:11:07",
                                  "score": 24,
                                  "num_children": 1,
                                  "author": 286151,
                                  "replies": [
                                    {
                                      "id": "iqm6a7o",
                                      "text": "[removed]",
                                      "timestamp": "2022-10-01 12:12:07",
                                      "score": 1,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "iqm6d4t",
                                          "text": "Yes. And it does not support this claim:\n\n> 99% percent of abortions that are couples just mingling and fucking\n\nThat claim has now been established as a lie. Why did you lie?",
                                          "timestamp": "2022-10-01 12:13:00",
                                          "score": 19,
                                          "num_children": 0,
                                          "author": 286151,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "iqmeui6",
                                  "text": "It doesn't matter when life starts, it matters when we give it rights as a person. And that should only happen after it is surviving on its own outside of the womb.\n\nThe government should not be involved in the decision of whether an abortion is medically necessary or not. It should only be between a pregnant person and their doctor.",
                                  "timestamp": "2022-10-01 13:31:28",
                                  "score": 10,
                                  "num_children": 0,
                                  "author": 366304,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "iqm43ej",
                      "text": "[removed]",
                      "timestamp": "2022-10-01 11:48:28",
                      "score": -3,
                      "num_children": 2,
                      "replies": [
                        {
                          "id": "iqm5bkt",
                          "text": "So 74.9% no reason given proves your 99% claim, does it?",
                          "timestamp": "2022-10-01 12:01:57",
                          "score": 27,
                          "num_children": 1,
                          "author": 286151,
                          "replies": [
                            {
                              "id": "iqm5pmj",
                              "text": "[removed]",
                              "timestamp": "2022-10-01 12:05:56",
                              "score": -2,
                              "num_children": 4,
                              "replies": [
                                {
                                  "id": "iqm788q",
                                  "text": "Why, and i mean this most sincerely, the FUCK does anybody need to justify *their* abortion to you, some random Floridian shithead?",
                                  "timestamp": "2022-10-01 12:21:45",
                                  "score": 27,
                                  "num_children": 1,
                                  "author": 123252,
                                  "replies": [
                                    {
                                      "id": "iqm7gfn",
                                      "text": "[removed]",
                                      "timestamp": "2022-10-01 12:23:59",
                                      "score": 0,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "iqm7zww",
                                          "text": "[removed]",
                                          "timestamp": "2022-10-01 12:29:30",
                                          "score": 12,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "iqm84xy",
                                              "text": "[removed]",
                                              "timestamp": "2022-10-01 12:30:56",
                                              "score": 1,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "iqm8bsf",
                                                  "text": "[removed]",
                                                  "timestamp": "2022-10-01 12:32:49",
                                                  "score": 6,
                                                  "num_children": 1,
                                                  "replies": [
                                                    {
                                                      "id": "iqm8k5o",
                                                      "text": "[removed]",
                                                      "timestamp": "2022-10-01 12:35:09",
                                                      "score": 0,
                                                      "num_children": 0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "iqm78ol",
                                  "text": "The reason for an abortion is any goddam reason a woman wants to have an abortion.",
                                  "timestamp": "2022-10-01 12:21:53",
                                  "score": 26,
                                  "num_children": 1,
                                  "author": 296356,
                                  "replies": [
                                    {
                                      "id": "iqm7joe",
                                      "text": "[removed]",
                                      "timestamp": "2022-10-01 12:24:53",
                                      "score": -2,
                                      "num_children": 2,
                                      "replies": [
                                        {
                                          "id": "iqm8skn",
                                          "text": "It's not a good argument *for you*.  But you have no say in their lives so your opinion doesn't matter.",
                                          "timestamp": "2022-10-01 12:37:27",
                                          "score": 19,
                                          "num_children": 1,
                                          "author": 204433,
                                          "replies": [
                                            {
                                              "id": "iqm8wea",
                                              "text": "[removed]",
                                              "timestamp": "2022-10-01 12:38:29",
                                              "score": -3,
                                              "num_children": 3,
                                              "replies": [
                                                {
                                                  "id": "iqm9q0d",
                                                  "text": "Who are you to say what's right for a woman and her own body?\n\nFor the record, my opinion on another woman's body doesn't matter, either.  As a woman, I personally would not abort.  But that's me.  I would not, nor should not, tell another woman she has no right to decide what to do with her body.  And neither should you.  You have absolutely no idea what she's facing in her life.  You don't know her mental, financial, or medical status.  You are not her partner.  You are simply a stranger who thinks that abortion is wrong, and you are entitled to feel that way.  But you are not entitled to push that opinion on anyone else or tell them they are wrong for having their own opinion. \n\nAbortion is a medical decision between a woman and her doctor.  No one, absolutely no one, should force a woman to carry a fetus to term if she doesn't want to.",
                                                  "timestamp": "2022-10-01 12:46:15",
                                                  "score": 15,
                                                  "num_children": 0,
                                                  "author": 204433,
                                                  "replies": []
                                                },
                                                {
                                                  "id": "iqmecnd",
                                                  "text": "You can say what YOU think is right and wrong, but that doesn't have anything to do with someone else's choices.",
                                                  "timestamp": "2022-10-01 13:27:13",
                                                  "score": 9,
                                                  "num_children": 0,
                                                  "author": 161423,
                                                  "replies": []
                                                },
                                                {
                                                  "id": "iqmjnqm",
                                                  "text": "You think you should have a say in what another can do with their body. \n\nTHAT’S FUCKED UP",
                                                  "timestamp": "2022-10-01 14:10:08",
                                                  "score": 5,
                                                  "num_children": 0,
                                                  "author": 263485,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "id": "iqma47m",
                                          "text": "It's the only argument, and the only one needed.",
                                          "timestamp": "2022-10-01 12:49:58",
                                          "score": 12,
                                          "num_children": 0,
                                          "author": 356040,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "iqm663r",
                                  "text": "You don't know the reason for the majority of abortions. That is a false claim.",
                                  "timestamp": "2022-10-01 12:10:53",
                                  "score": 20,
                                  "num_children": 0,
                                  "author": 286151,
                                  "replies": []
                                },
                                {
                                  "id": "iqma1yz",
                                  "text": "Justifiable to who, you? Who the fuck are you to decide for someone else?",
                                  "timestamp": "2022-10-01 12:49:24",
                                  "score": 14,
                                  "num_children": 0,
                                  "author": 356040,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "iqm5zmn",
                          "text": "So? Any reason for an abortion is a good reason. We get it, you hate women. But no one should be forced to carry a pregnancy they don’t want. Choosing to be ignorant of the importance of women’s right to choose isn’t going to change that. You’re a hateful and miserable person. If god was real I’m 100% positive hell would be full of scum like you lol.",
                          "timestamp": "2022-10-01 12:08:56",
                          "score": 17,
                          "num_children": 0,
                          "author": 6284,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "iqmmzjc",
          "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n- This comment has been removed for trolling or shitposting. Even if your intent is not to troll or shitpost, certain words and phrases are enough for removal. This rule is applied strictly and may lead to an immediate ban.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
          "timestamp": "2022-10-01 14:35:05",
          "score": 3,
          "num_children": 0,
          "author": 122319,
          "replies": []
        }
      ]
    },
    {
      "id": "iqnfdj5",
      "text": "Hol up.\n\nNot killing babies is a good thing.  I even believe it to be one of the 10 commandments (thou shalt not kill).  \n\nSo why would God punish Florida when it reduced the chance to kill (a baby)?",
      "timestamp": "2022-10-01 17:57:06",
      "score": -11,
      "num_children": 3,
      "author": 305227,
      "replies": [
        {
          "id": "iqnqmyr",
          "text": "Fertilized cells are not babies.",
          "timestamp": "2022-10-01 19:17:52",
          "score": 8,
          "num_children": 0,
          "author": 241133,
          "replies": []
        },
        {
          "id": "iqqbjn6",
          "text": "[This is a baby?](https://upload.wikimedia.org/wikipedia/commons/7/7b/Human_blastocyst.jpg) It doesn't look like a baby.",
          "timestamp": "2022-10-02 09:35:48",
          "score": 1,
          "num_children": 0,
          "author": 286151,
          "replies": []
        },
        {
          "id": "iqrm298",
          "text": "babies?  huh?  Did you reply to the wrong post?",
          "timestamp": "2022-10-02 16:24:28",
          "score": 1,
          "num_children": 1,
          "author": 2762,
          "replies": [
            {
              "id": "iqrvl2z",
              "text": "So Roe v Wade was about land titles?\n\nThere never was a right to privacy in the constitution.  There never was a right to an abortion.  If you read the constitution it clearly states that powers not specifically enumerated to the Federal Government are reserved for the the people, OR THE STATES.\n\nEven liberal scholars have long admitted that Roe was bad law, and never had any legal basis in the Constitution, and should have remained a State issue. If the people of a State want to ban abortion, that's their right.  Just like a State that wants to allow it.  No one is forcing a woman to live in a State that bans or allows abortion.  They are free to find a place to live that suits them.",
              "timestamp": "2022-10-02 17:25:36",
              "score": 0,
              "num_children": 1,
              "author": 305227,
              "replies": [
                {
                  "id": "iqw8vjg",
                  "text": "Why did you say \"babies\" if you are talking about abortion?  You do realize that nobody is \"killing babies\", right?  If you want to talk about abortion, that's fine, but your hyperbole just shows that you aren't serious and don't know what you're talking about; that you're willing to exagerrate in order to win an argument.  If babies are actually being murdered that would be a big deal, however, a baby is not the same as a fetus and I'll bet that somewhere deep down you know this.",
                  "timestamp": "2022-10-03 15:42:59",
                  "score": 1,
                  "num_children": 0,
                  "author": 2762,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iqmujyc",
      "text": "[removed]",
      "timestamp": "2022-10-01 15:30:46",
      "score": -13,
      "num_children": 2,
      "replies": [
        {
          "id": "iqmwrge",
          "text": "You are missing the point completely, but it's understandable since you lack critical thinking.",
          "timestamp": "2022-10-01 15:46:42",
          "score": 8,
          "num_children": 0,
          "author": 338405,
          "replies": []
        },
        {
          "id": "iqn51zg",
          "text": "Fuck your god, your worthless shit myths, and fuck that dried up corpse on a cross. Mindless zombie hit the road.",
          "timestamp": "2022-10-01 16:45:32",
          "score": 6,
          "num_children": 0,
          "author": 90838,
          "replies": []
        }
      ]
    },
    {
      "id": "iqme85u",
      "text": "But why would they? They know the mind of god, and he wanted Roe overturned.\n\nIt’s actually god wanting DeSantis to be president, so this is gods way of generating sympathy for him and Florida.",
      "timestamp": "2022-10-01 13:26:10",
      "score": -19,
      "num_children": 1,
      "author": 412445,
      "replies": [
        {
          "id": "iqoe8do",
          "text": "Lol but some will actually buy such shit!",
          "timestamp": "2022-10-01 22:11:42",
          "score": 1,
          "num_children": 0,
          "author": 6054,
          "replies": []
        }
      ]
    },
    {
      "id": "iqmri23",
      "text": "I don't get trying to be funny when talking about religion. But I guess if you don't believe in something you will fall for anything.",
      "timestamp": "2022-10-01 15:08:29",
      "score": -17,
      "num_children": 6,
      "author": 1948,
      "replies": [
        {
          "id": "iqmviks",
          "text": "If one of the tenets of your belief is that you should do so without evidence, you may have already fallen for something.",
          "timestamp": "2022-10-01 15:37:42",
          "score": 16,
          "num_children": 0,
          "author": 161637,
          "replies": []
        },
        {
          "id": "iqmyiym",
          "text": "Because someone doesn't believe in a god, you think they don't believe in anything? That is totally weird. Lol.",
          "timestamp": "2022-10-01 15:59:24",
          "score": 9,
          "num_children": 0,
          "author": 356040,
          "replies": []
        },
        {
          "id": "iqnk9ch",
          "text": "Ah, the old \"if you don't believe the same as me you must believe in nothing!\" line never gets old...",
          "timestamp": "2022-10-01 18:31:40",
          "score": 7,
          "num_children": 1,
          "author": 175727,
          "replies": [
            {
              "id": "iqnkiaj",
              "text": "I could literally say the same thing to you 😆 I think that speaks volumes in its self.",
              "timestamp": "2022-10-01 18:33:30",
              "score": -10,
              "num_children": 2,
              "author": 1948,
              "replies": [
                {
                  "id": "iqnx4rm",
                  "text": "> I think that speaks volumes in its self.\n\n…..it doesnt…..",
                  "timestamp": "2022-10-01 20:05:46",
                  "score": 5,
                  "num_children": 0,
                  "author": 128819,
                  "replies": []
                },
                {
                  "id": "iqqvvv3",
                  "text": "Ah, the old \"I'm rubber your glue\" defence.  Glad to see we are using grade school argument tactics...",
                  "timestamp": "2022-10-02 13:21:51",
                  "score": 2,
                  "num_children": 0,
                  "author": 175727,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iqnls12",
          "text": "> But I guess if you don't believe in something you will fall for anything.\n\nYou probably don't believe in Leprechauns.  Does that mean you will fall for anything?  \n\nIt actually works the other way.  The fact that someone is skeptical about claims makes them less likely to fall for \"anything.\"\n\nChristians tell themselves a lot of things about atheists that are not true.  \"Atheists don't believe in anything\" is just one of those bits of nonsense.",
          "timestamp": "2022-10-01 18:42:40",
          "score": 7,
          "num_children": 0,
          "author": 122319,
          "replies": []
        },
        {
          "id": "iqmxalk",
          "text": "I think you got it backwards.",
          "timestamp": "2022-10-01 15:50:32",
          "score": 7,
          "num_children": 0,
          "author": 72501,
          "replies": []
        },
        {
          "id": "iqnepr9",
          "text": "Most religions are built on blind faith, so I really don't get your second sentence there.",
          "timestamp": "2022-10-01 17:52:32",
          "score": 7,
          "num_children": 0,
          "author": 184308,
          "replies": []
        }
      ]
    },
    {
      "id": "iqn79zn",
      "text": "[removed]",
      "timestamp": "2022-10-01 17:01:03",
      "score": -16,
      "num_children": 5,
      "replies": [
        {
          "id": "iqn8wpr",
          "text": "Because there is no actual evidence to support that belief, so in that sense it is only a belief and nothing more",
          "timestamp": "2022-10-01 17:12:24",
          "score": 7,
          "num_children": 0,
          "author": 20557,
          "replies": []
        },
        {
          "id": "iqncuso",
          "text": "Lol you’re the one stupid enough to believe some bullshit book written by man slapnuts",
          "timestamp": "2022-10-01 17:39:47",
          "score": 7,
          "num_children": 0,
          "author": 200407,
          "replies": []
        },
        {
          "id": "iqnazc2",
          "text": "Very convincing counter argument. I am now converting immediately. Now to which religion is the question....",
          "timestamp": "2022-10-01 17:26:45",
          "score": 5,
          "num_children": 0,
          "author": 123972,
          "replies": []
        },
        {
          "id": "iqne0fh",
          "text": "That's actually not a belief held by all atheists. Some believe in an afterlife, but the defining belief held along atheists is just that there is no God or Gods.\n\nRegardless, why are you in an atheism subreddit being inflammatory, anyways?",
          "timestamp": "2022-10-01 17:47:44",
          "score": 5,
          "num_children": 0,
          "author": 184308,
          "replies": []
        },
        {
          "id": "iqoe4lq",
          "text": "You mean you, before indoctrination?",
          "timestamp": "2022-10-01 22:10:51",
          "score": 2,
          "num_children": 0,
          "author": 6054,
          "replies": []
        }
      ]
    },
    {
      "id": "iqphtz4",
      "text": "Wow. The stupidity of this comment and the ensuing popularity of such a nonsensical  statement really does a great job at demonstrating how hatred and other uncontrolled emotions completely block the ability to reason. You’re all making a mockery of atheism. Stand strong and independent, not as a mere foil to a religious group you irrationally hate simply because of your Christian aunt you couldn’t stand growing up. Is that it, is everyone on this sub age 16 and lower?",
      "timestamp": "2022-10-02 03:36:54",
      "score": -8,
      "num_children": 0,
      "author": 327477,
      "replies": []
    },
    {
      "id": "iqmy1d4",
      "text": "What does Florida have to do with rvw getting overturned?",
      "timestamp": "2022-10-01 15:55:57",
      "score": -7,
      "num_children": 0,
      "author": 284579,
      "replies": []
    },
    {
      "id": "iqnb8v7",
      "text": "Hard to say who’s more crazy, the ppl you slam or supporters of your cause.",
      "timestamp": "2022-10-01 17:28:37",
      "score": -8,
      "num_children": 0,
      "author": 183862,
      "replies": []
    },
    {
      "id": "iqomeus",
      "text": "As an atheist… I urge you to really think and reconsider your post.  Think hard.",
      "timestamp": "2022-10-01 23:14:58",
      "score": -7,
      "num_children": 1,
      "author": 388603,
      "replies": [
        {
          "id": "iqroogj",
          "text": "Are you saying that some christians in Florida ARE saying \"this is God's wrath for overturning Roe v Wade?  I guess I'd believe it, considering that the bible is all for abortions, but I'm pretty sure no christian has actually read the whole book before so it's easier to just pick and choose what you think is in it.  It's like a Schrodinger's Cat, you can't be wrong if you haven't read it yet.",
          "timestamp": "2022-10-02 16:41:18",
          "score": 1,
          "num_children": 0,
          "author": 2762,
          "replies": []
        }
      ]
    },
    {
      "id": "iqmzqtq",
      "text": "I've not seen anyone actually say this is retribution for anything. \n\nI've heard 5 or 6 people say \"You don't hear X saying Y about......\". Are people just pretending that the people saying this aren't the bullies? It's like, do you think you're fooling people? You're just being passive aggressive about it because you feel validated in your rightness. You're being manipulative by attributing your own evil thoughts to others you perceive as being evil, ignorant of the fact that these are actually your thoughts. \n\nThe cognitive dissonance required to ignore the fact that these ideas you are disparaging are coming from you and not in response to anyone else is truly artisan.",
      "timestamp": "2022-10-01 16:07:58",
      "score": -6,
      "num_children": 0,
      "author": 378462,
      "replies": []
    },
    {
      "id": "iqnmfrp",
      "text": "Did you remember to smother your house with horse paste?",
      "timestamp": "2022-10-01 18:47:24",
      "score": -4,
      "num_children": 0,
      "author": 405767,
      "replies": []
    },
    {
      "id": "iqni15y",
      "text": "lmao you think this is the smartest shit of all time. why would god be pro abortion",
      "timestamp": "2022-10-01 18:15:40",
      "score": -2,
      "num_children": 1,
      "replies": [
        {
          "id": "iqrlhxr",
          "text": "Probably because he tells people how to perform an abortion in the bible, and there's also plenty of stories about god murdering tons of babies, in fact he killed every baby on the planet one day.  Christians are the only ones who give a shit about that, not the god of the bible, he's just a scapegoat.",
          "timestamp": "2022-10-02 16:20:52",
          "score": 2,
          "num_children": 0,
          "author": 2762,
          "replies": []
        }
      ]
    },
    {
      "id": "iqpjv2g",
      "text": "Or maybe it's just a common occurrence that happens in Florida. Yall stupid",
      "timestamp": "2022-10-02 03:56:40",
      "score": -3,
      "num_children": 0,
      "author": 289004,
      "replies": []
    },
    {
      "id": "iqmyji1",
      "text": "Why would a Christian think God would be angry for overturning Roe v Wade? Isnt it what God would want?",
      "timestamp": "2022-10-01 15:59:30",
      "score": -1,
      "num_children": 0,
      "author": 77381,
      "replies": []
    },
    {
      "id": "iqoizox",
      "text": "[removed]",
      "timestamp": "2022-10-01 22:48:31",
      "score": -1,
      "num_children": 1,
      "replies": [
        {
          "id": "iqok6vs",
          "text": "No, it’s not, but why would you think so?",
          "timestamp": "2022-10-01 22:57:45",
          "score": 2,
          "num_children": 1,
          "author": 338225,
          "replies": [
            {
              "id": "iqon3nq",
              "text": "They have no taste",
              "timestamp": "2022-10-01 23:20:27",
              "score": 1,
              "num_children": 0,
              "author": 317976,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iqq1hkd",
      "text": "Who's Roe v Wade?",
      "timestamp": "2022-10-02 07:22:18",
      "score": -1,
      "num_children": 0,
      "author": 144891,
      "replies": []
    },
    {
      "id": "ir8rsi7",
      "text": "What does atheism have to do with abortion?",
      "timestamp": "2022-10-06 04:28:26",
      "score": 0,
      "num_children": 0,
      "author": 32977,
      "replies": []
    }
  ]
}