{
  "id": "xyb27p",
  "text": "Feminists be like, I slept with a guy because that's easier than having a job, anyway he raped me.\n",
  "timestamp": "2022-10-07 21:40:17",
  "score": 884,
  "subreddit": "t5_2zaj2",
  "num_children": 35,
  "author": 378235,
  "replies": [
    {
      "id": "irgbtt2",
      "text": "This reminds me of the video where the guy drove around (I think it was paris) and tried to pay prostitutes to come clean his apartment and they all said no.",
      "timestamp": "2022-10-07 21:59:09",
      "score": 129,
      "num_children": 9,
      "author": 326113,
      "replies": [
        {
          "id": "irgyomz",
          "text": "Some said it would take too long. Sex is easier money for them.",
          "timestamp": "2022-10-08 01:27:07",
          "score": 56,
          "num_children": 0,
          "author": 385720,
          "replies": []
        },
        {
          "id": "irgowmn",
          "text": "HA!  No shit I got a call out of the blue from an old roommate's ex gf.  She offered to fulfill any of my fantasies for $60⁰⁰.  She was unaware that I'd gotten married, I covered the mouthpiece of the phone and whispered to my wife what was going on.   Wife said\nTell her to clean my apartment. \n\nI did.\n\nLoud click and a dial tone.",
          "timestamp": "2022-10-07 23:56:11",
          "score": 64,
          "num_children": 0,
          "author": 5933,
          "replies": []
        },
        {
          "id": "irgk9wd",
          "text": "What kind of woman do you think I am?",
          "timestamp": "2022-10-07 23:13:09",
          "score": 53,
          "num_children": 0,
          "author": 196342,
          "replies": []
        },
        {
          "id": "irhddhy",
          "text": "a woman can make 300$ an hour i think to have sex with a dude. how much do doctors and lawyers make an hour?",
          "timestamp": "2022-10-08 03:53:51",
          "score": 24,
          "num_children": 3,
          "author": 377566,
          "replies": [
            {
              "id": "irjk0r6",
              "text": "Pretty sure doctors and lawyers can earn more than that depending on reputation and difficult cases",
              "timestamp": "2022-10-08 18:46:43",
              "score": 6,
              "num_children": 0,
              "author": 344971,
              "replies": []
            },
            {
              "id": "irimcun",
              "text": "yeah but there are occupational hazards lol",
              "timestamp": "2022-10-08 14:09:29",
              "score": 3,
              "num_children": 0,
              "author": 264476,
              "replies": []
            },
            {
              "id": "irlqtkl",
              "text": "$/hr isn't really a good metric for that line of work as most of it is sole proprietorship,  It depends on supply, demand and competition. The earnings will generally be of a wide variety of amounts with a few being high, some medium and most being low.",
              "timestamp": "2022-10-09 05:58:49",
              "score": 1,
              "num_children": 0,
              "author": 48705,
              "replies": []
            }
          ]
        },
        {
          "id": "irk58qe",
          "text": "hahahahahahahahahh.",
          "timestamp": "2022-10-08 21:34:45",
          "score": 3,
          "num_children": 0,
          "author": 1498,
          "replies": []
        },
        {
          "id": "irhdage",
          "text": "i love this",
          "timestamp": "2022-10-08 03:52:52",
          "score": 6,
          "num_children": 0,
          "author": 377566,
          "replies": []
        },
        {
          "id": "irixv8x",
          "text": "Please post it if you can find it",
          "timestamp": "2022-10-08 15:49:37",
          "score": 2,
          "num_children": 0,
          "author": 153989,
          "replies": []
        },
        {
          "id": "irhvf1g",
          "text": "No? Thsts easy cash for a simple task",
          "timestamp": "2022-10-08 08:05:51",
          "score": 2,
          "num_children": 0,
          "author": 19811,
          "replies": []
        },
        {
          "id": "irj9q31",
          "text": "Sounds like human trafficking tactics",
          "timestamp": "2022-10-08 17:24:20",
          "score": 0,
          "num_children": 1,
          "author": 348874,
          "replies": [
            {
              "id": "irjj4cq",
              "text": "I wouldn't know, I've never been trafficked or trafficked anyone.",
              "timestamp": "2022-10-08 18:39:25",
              "score": 2,
              "num_children": 0,
              "author": 326113,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "irgcu4h",
      "text": "Guess I'm raping my barista every time i get a coffee 😳",
      "timestamp": "2022-10-07 22:07:47",
      "score": 82,
      "num_children": 2,
      "author": 316265,
      "replies": [
        {
          "id": "irgpt35",
          "text": "Wait... theoretically speaking, if you were to pay yourself for making your own coffee... would that be... raping yourself??",
          "timestamp": "2022-10-08 00:04:32",
          "score": 41,
          "num_children": 1,
          "author": 343387,
          "replies": [
            {
              "id": "irgsluy",
              "text": "According to american christians, masterbating is self rape",
              "timestamp": "2022-10-08 00:30:36",
              "score": 16,
              "num_children": 3,
              "author": 396688,
              "replies": [
                {
                  "id": "irhwesg",
                  "text": "This is false.",
                  "timestamp": "2022-10-08 08:22:19",
                  "score": 2,
                  "num_children": 1,
                  "author": 229242,
                  "replies": [
                    {
                      "id": "irk1q7a",
                      "text": "https://www.huffpost.com/entry/ex-masturbator-t-shirts-p_n_163937",
                      "timestamp": "2022-10-08 21:07:25",
                      "score": 0,
                      "num_children": 1,
                      "author": 396688,
                      "replies": [
                        {
                          "id": "irk24za",
                          "text": "Firstly, unless I've completely missed it, nowhere in that does it say its self rape. Secondly, you're making a vast generalisation based on one post or a few Christians when many millions of people follow Christ.",
                          "timestamp": "2022-10-08 21:10:29",
                          "score": 1,
                          "num_children": 1,
                          "author": 229242,
                          "replies": [
                            {
                              "id": "irk2bnk",
                              "text": "Aren't christians supposed to cut out their eye if their eyes causes them to lust?",
                              "timestamp": "2022-10-08 21:11:56",
                              "score": 0,
                              "num_children": 1,
                              "author": 396688,
                              "replies": [
                                {
                                  "id": "irk64b2",
                                  "text": "That was a metaphor. Jesus clearly made it clear the point is to remove the temptation. Taking everything out of context isn't a good way of evaluating a historic text.",
                                  "timestamp": "2022-10-08 21:41:31",
                                  "score": 1,
                                  "num_children": 2,
                                  "author": 229242,
                                  "replies": [
                                    {
                                      "id": "irlr0t2",
                                      "text": "Please tell literalist christians that, maybe they'd listen to you and stop bothering everyone else",
                                      "timestamp": "2022-10-09 06:01:20",
                                      "score": 0,
                                      "num_children": 0,
                                      "author": 396688,
                                      "replies": []
                                    },
                                    {
                                      "id": "isprqta",
                                      "text": "The bible is full of contradictions and most people don't even follow it properly. They have turned a book into something generates money.",
                                      "timestamp": "2022-10-17 20:05:09",
                                      "score": 0,
                                      "num_children": 1,
                                      "author": 97268,
                                      "replies": [
                                        {
                                          "id": "ispsdbr",
                                          "text": "Its actually the most historically accurate book ever if you look through the external evidence for it, and many of the \"contradictions\" are down to translation or misconceptions. \n\nYou're right many people don't follow it properly tho. \n\nMegachurches have definitely given Christianity a bad name for a money making machine. That is precisely what Jesus said it should not be, which is why he flipped over the money tables in the temple.",
                                          "timestamp": "2022-10-17 20:09:15",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 229242,
                                          "replies": [
                                            {
                                              "id": "istfw4o",
                                              "text": "That's a good response. And specifically I was thinking what you mentioned. Jesus did say don't build any monument to worship or prey for me. \n\nSo does this mean that churches are actually going against the very same person they worship? Plus the billions tax free money they make.\n\nI'm sure you know the bible more than me. I've through it but not thoroughly. Some of it is very far fetched though. Personally I think it was a book made to control the massess. \n\nI mean creation in 7 days when the earth was here long before.\nNoah, the man who summons all the animals around the world and put them all together on a boat.\nA man that can part an ocean and turn water into wine\nA man and a woman that stated it because the woman are an apple\nDon't shop on Sunday\nIt's a sin to be gay\n\nFor me personally, it's fantasy. And it all sounds very man made.\n\nAgain, I'm not a scholar of the book. And I'm sure there is many good messages and wisdom. It's something I should look into on a deeper level. Maybe it's unfair to write this given my current knowledge. But it seems valid In my mind anyway",
                                              "timestamp": "2022-10-18 16:02:06",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 97268,
                                              "replies": [
                                                {
                                                  "id": "it6zxpq",
                                                  "text": "Sorry its late:\n\nJesus said not to build a monument to Him for a couple of reasons.\n\nOne because we don't know what He looked like and we're then worshipping a bit of stone or metal instead of Christ.\n\nTwo because many of His followers had the confused idea that He had come to conquer the Romans. Building monuments of Himself and making temples to Him while He was on earth would reinforce this idea. \n\nChurches are a thing that are a good and proper thing in the New Testament Church started by Christ. The reasons He said not to when He was around were for the reasons I set out before. Not building monuments to Him is still actually a thing, a lot og Churches realise this and don't have any statues or images of Christ in them, but sadly some don't realise they're actually going against the Lord they say they follow. \n\nAs for the money the megachurches make, yes that is criminal. Christian charities and Churches do need money to function and to extend their reach and do good work in their communities, but when its so clear so much of the money is just going into the people at the top's pockets, that is the furthest thing from what Jesus said to do. He was very clear we should give generously to God and to helping the poor and the sick.\n\nAs for Creation in 6 days, it is about as farfetched as saying everything came from nothing, which breaks the laws of physics anyway. The point is the beginning of the universe was miraculous, however it came to be, and whichever theory you believe it requires a lot of faith and it's impossible to prove either way. \n\nMany of the ideas of the long earth theory of billions of years etc are built on the assumption that creation did not happen, and based on massively inaccurate carbon dating which has been shown to be horrifically unhelpful, (like in this article https://www.siliconrepublic.com/innovation/carbon-dating-accuracy-major-flaw) such as when they carbon dated a rock with a screw in it to several million years old https://www.cultofweird.com/science/ancient-screw-in-rock/ \nIts happened like that several times. People claim that that means ancient civilisations were intelligent, but that completely contradicts the idea of evolution. I'm not an archeologist and so don't know every detail, but I've found several accounts of things like that happening. \n\nAs for Noah and the flood, the evidence for the global flood is pretty astounding when you look into it. https://earthage.org/scientific-evidence-for-a-worldwide-flood/ \nOnce again a lot of this goes back to archeology which once again is not my field but there have been many findings of fish being fossilised while eating another fish, suggesting they were fossilised rapidly under intense pressure, which can be explained by the verses in Genesis talking about the \"fountains of the deep\" being opened up and the pressure being immense.\n\nWe don't know everything about how it all happened but we don't know everything about how much of history happened. It would certainly explain many of the strange formations of ground and rock all around the world, like canyons and such, as well as the clear fact that the continents are shaped that they fit together and are widely accepted to have been connected at one point. I believe the flood seperated them. \n\nI know that's not really proof, but its certainly worth considering. \n\nAs for him summoning all the animals of the world, given that the world was not split into continents, it would not have been as difficult to find all the different species. It is also worth noting that he didn't take every species, but every kind. \n\nThis would have been much easier than gathering every species. Aswell as this, if anyone would be reluctant to accept the idea of God calling the animals, (which, if we are to take the view that God could exist, He is clearly more than capable of doing something like that) then it is worth considering that this was before the shortening of the human lifespan, Noah was around 600 years old when the ark was completed. This means he would have had more than enough time to gather all the animals. \n\nThere is a lot of evidence for much of the Bible. It is a historic book. The miracles (which have been documented clearly outside of the Bible https://carm.org/about-jesus/is-there-historical-evidence-of-jesus-miracles/ https://ryanleasure.com/evidence-for-jesus-miracles-outside-the-bible/ https://www.revelationrevolution.org/surprising-amount-evidence-historical-jesus-performed-miracles/) are only evidence of the existence of an all-capable God. \n\nI understand that it doesn't make sense to you, and it takes time to develop an understanding of it all, we never stop learning. I've certainly still got a lot more to learn. \n\nIk that's long lol sorry, I hope it helps tho :)",
                                                  "timestamp": "2022-10-21 12:00:25",
                                                  "score": 1,
                                                  "num_children": 0,
                                                  "author": 229242,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iri25a9",
                  "text": "You are the very definition of confidently incorrect.",
                  "timestamp": "2022-10-08 09:59:57",
                  "score": 1,
                  "num_children": 1,
                  "author": 76727,
                  "replies": [
                    {
                      "id": "irk1r3n",
                      "text": "https://www.huffpost.com/entry/ex-masturbator-t-shirts-p_n_163937",
                      "timestamp": "2022-10-08 21:07:36",
                      "score": 0,
                      "num_children": 1,
                      "author": 396688,
                      "replies": [
                        {
                          "id": "irk8ltg",
                          "text": "Hmmm. That's odd. I don't see anywhere where this article said \"masterbation is self-rape.\" Could you please show me where the article says that?",
                          "timestamp": "2022-10-08 22:00:49",
                          "score": 1,
                          "num_children": 0,
                          "author": 76727,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iriz6rw",
                  "text": "More like Muslim Saudis",
                  "timestamp": "2022-10-08 16:00:36",
                  "score": 0,
                  "num_children": 0,
                  "author": 37753,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "irgetii",
          "text": "#ruinedforothermen",
          "timestamp": "2022-10-07 22:24:59",
          "score": 8,
          "num_children": 0,
          "author": 178038,
          "replies": []
        }
      ]
    },
    {
      "id": "irhak1y",
      "text": "However, Fellas Pay attention.  \n\nShe is an anti-sex work feminist.  Most older generation Feminists are.  But....The younger generation are pro sex work feminists.  They HATE each other.  But, usually come to a common ground, \"hating on men\".",
      "timestamp": "2022-10-08 03:23:00",
      "score": 18,
      "num_children": 1,
      "author": 324647,
      "replies": [
        {
          "id": "irizxtu",
          "text": "Similar thing with the trans issue, the old ones hate trans “women” for being men, and the young ones love them because they have been conditioned to hate being men.",
          "timestamp": "2022-10-08 16:06:49",
          "score": 7,
          "num_children": 0,
          "author": 37753,
          "replies": []
        }
      ]
    },
    {
      "id": "irgcypj",
      "text": "I bet she thinks if you didn’t like sex with a guy it’s considered rape",
      "timestamp": "2022-10-07 22:08:54",
      "score": 90,
      "num_children": 3,
      "author": 410897,
      "replies": [
        {
          "id": "irges8z",
          "text": "What’s truly scary is, if everything is rape, nothing is rape.",
          "timestamp": "2022-10-07 22:24:40",
          "score": 53,
          "num_children": 3,
          "author": 317142,
          "replies": [
            {
              "id": "irghev1",
              "text": "True. These women don't realize the harm they are causing to actual victims of rape and abuse.",
              "timestamp": "2022-10-07 22:47:39",
              "score": 40,
              "num_children": 0,
              "author": 270078,
              "replies": []
            },
            {
              "id": "irhdhe3",
              "text": "yup. just like racism. if everything is racist, well then...",
              "timestamp": "2022-10-08 03:55:05",
              "score": 17,
              "num_children": 0,
              "author": 377566,
              "replies": []
            },
            {
              "id": "irixzvk",
              "text": "you think she understands things in that way ?",
              "timestamp": "2022-10-08 15:50:40",
              "score": 0,
              "num_children": 0,
              "author": 153989,
              "replies": []
            }
          ]
        },
        {
          "id": "irjsaav",
          "text": "Happened to Aziz Ansari",
          "timestamp": "2022-10-08 19:55:02",
          "score": 2,
          "num_children": 0,
          "author": 145194,
          "replies": []
        },
        {
          "id": "irhviee",
          "text": "People who think like this are just childish... you consented and didn't put in the effort to make it enjoyable, then scream for attention to ruin another person's life",
          "timestamp": "2022-10-08 08:07:21",
          "score": 3,
          "num_children": 0,
          "author": 19811,
          "replies": []
        }
      ]
    },
    {
      "id": "irgatps",
      "text": "This woman probably walked into a brothel looking to be a hooker and got turned away",
      "timestamp": "2022-10-07 21:50:55",
      "score": 81,
      "num_children": 0,
      "author": 354634,
      "replies": []
    },
    {
      "id": "irgi3n7",
      "text": "this person definitely thinks words are violence.",
      "timestamp": "2022-10-07 22:53:38",
      "score": 30,
      "num_children": 1,
      "author": 369812,
      "replies": [
        {
          "id": "irgig36",
          "text": "Or even the lack thereof.",
          "timestamp": "2022-10-07 22:56:40",
          "score": 13,
          "num_children": 0,
          "author": 171580,
          "replies": []
        }
      ]
    },
    {
      "id": "irgdcit",
      "text": "But I thought sex work was real work?",
      "timestamp": "2022-10-07 22:12:15",
      "score": 56,
      "num_children": 5,
      "author": 144595,
      "replies": [
        {
          "id": "irgywqa",
          "text": "Women can’t decide if it’s exploitation or empowerment. Just like everything else…",
          "timestamp": "2022-10-08 01:29:16",
          "score": 39,
          "num_children": 3,
          "author": 385720,
          "replies": [
            {
              "id": "irhs5d7",
              "text": "Oh that's easy to answer: it's whatever argument is convenient at the time.",
              "timestamp": "2022-10-08 07:14:01",
              "score": 12,
              "num_children": 1,
              "author": 23671,
              "replies": [
                {
                  "id": "irhxymm",
                  "text": "This tbh. This is kinda how feminism is with any given \"issue\".",
                  "timestamp": "2022-10-08 08:48:43",
                  "score": 4,
                  "num_children": 0,
                  "author": 359360,
                  "replies": []
                }
              ]
            },
            {
              "id": "irk1ncu",
              "text": "Almost not like all women share the same opinions and they disagree on this subject. Women aren’t a hive mind.",
              "timestamp": "2022-10-08 21:06:51",
              "score": 3,
              "num_children": 1,
              "author": 309124,
              "replies": [
                {
                  "id": "irk1z4c",
                  "text": "Obviously. Generalities exist…for a reason.\n\nJust like, “men are trash”. Ever heard that line before? Do you bring the same energy to those women when you read/hear that?",
                  "timestamp": "2022-10-08 21:09:15",
                  "score": 1,
                  "num_children": 1,
                  "author": 385720,
                  "replies": [
                    {
                      "id": "irk244n",
                      "text": "You’re not generalizing tho. You said women can’t decide. There is no council of women taking a vote on what all women should think. So women haven’t decided because some women agree and some don’t. Your statement was just dumb.",
                      "timestamp": "2022-10-08 21:10:19",
                      "score": 2,
                      "num_children": 1,
                      "author": 309124,
                      "replies": [
                        {
                          "id": "irk2sac",
                          "text": "“Women” doesn’t equal ALL women. Ever heard of a generality? Clearly reading comprehension isn’t your strong suit.",
                          "timestamp": "2022-10-08 21:15:33",
                          "score": 2,
                          "num_children": 1,
                          "author": 385720,
                          "replies": [
                            {
                              "id": "irk35xq",
                              "text": "But what is the point of your generalization? Most women hold one opinion, the person in this tweet says they disagree, so you comment “women can’t decide”. So you’re generalizing women, but then when you find one different opinion, you generalize again and imply women are somehow contradicting themselves. You’re just being stupid and misogynist.",
                              "timestamp": "2022-10-08 21:18:34",
                              "score": 1,
                              "num_children": 1,
                              "author": 309124,
                              "replies": [
                                {
                                  "id": "irk4qqa",
                                  "text": "You’re focusing on semantics to distract from the point. Most adults with common sense understand the difference between absolutes and generalities. I shouldn’t have to explain it unless you’re a child (or feminist). \n\nTypical of the feminist movement (generally women). They can’t decide whether prostitution is empowering or exploitative. \n\nTheir argument: anything a women chooses is empowering simply because she made a choice and receives financial compensation, yet at the same time, men are pigs that only see women as sex objects and use prostitution as a tool to exploit women. So which is true? Both? Sounds like the movement can’t decide…",
                                  "timestamp": "2022-10-08 21:30:49",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 385720,
                                  "replies": [
                                    {
                                      "id": "irk567g",
                                      "text": "I’m not focusing on semantics, what you are saying literally makes no sense. When you say “which one is it ladies?” You’re implying women/feminists have all come to a single decision, but the truth is women aren’t in agreement. The reason why in your mind women can’t “decide” is because some women have one opinion and other women have a different opinion. Most adults with commen sense understand the idea that different people have different opinions. I shouldn’t have to explain that unless you’re a child.",
                                      "timestamp": "2022-10-08 21:34:12",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 309124,
                                      "replies": [
                                        {
                                          "id": "irk6imt",
                                          "text": "So if i wrote, “women in general” you’d have no complaints? Would that help you sleep better tonight?\n\nOk, women (in general) can’t make up their minds when it comes to prostitution being empowerment or exploitation. lol.",
                                          "timestamp": "2022-10-08 21:44:40",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 385720,
                                          "replies": [
                                            {
                                              "id": "irk6p6p",
                                              "text": "Lol no I still would. Jesus you are stupid. If “women in general” hold opinion A, and a woman tweets she has opinion B, it makes no sense for you to say “see women can’t make up their minds”. The way you worded your stupidity was not the issue here!",
                                              "timestamp": "2022-10-08 21:46:07",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 309124,
                                              "replies": [
                                                {
                                                  "id": "irk7nli",
                                                  "text": "So when you hear a woman say, “men are trash” do you assume they mean 100% of men or are you smart enough to deduce they mean…men in general?",
                                                  "timestamp": "2022-10-08 21:53:23",
                                                  "score": 2,
                                                  "num_children": 1,
                                                  "author": 385720,
                                                  "replies": [
                                                    {
                                                      "id": "irk8me3",
                                                      "text": "Again buddy, the stupid part of your comment wasn’t that I couldn’t tell you were generalizing. Idk how many times I can say that lmao.\n\nYou generalized, but then somehow got all mad that one woman didn’t fit your generalization. The things you are saying are just dumb. \n\nWhen I hear women say all men are trash I have enough common sense to realize they mean people like you.",
                                                      "timestamp": "2022-10-08 22:00:57",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 309124,
                                                      "replies": [
                                                        {
                                                          "id": "irk9j7e",
                                                          "text": "Its called a generality dude. Don’t get butt hurt at me because you’re the kind of person that takes every statement literally like Drax from Guardians of the Galaxy. Incapable reading between the lines lol.",
                                                          "timestamp": "2022-10-08 22:08:03",
                                                          "score": 2,
                                                          "num_children": 1,
                                                          "author": 385720,
                                                          "replies": [
                                                            {
                                                              "id": "irk9uoa",
                                                              "text": "Your reading skills are literally zero. I understand you are generalizing. The dumb part is that you are still perplexed and angry that the woman from this tweet doesn’t fit with your generalization.",
                                                              "timestamp": "2022-10-08 22:10:39",
                                                              "score": 1,
                                                              "num_children": 1,
                                                              "author": 309124,
                                                              "replies": [
                                                                {
                                                                  "id": "irkaj0w",
                                                                  "text": "Ohhh you’re a woman trolling the anti-feminist sub. A feminist troll. I digress. Makes total sense now. You’re mad because i wrote, “women”. If the message doesn’t fit you, just keep moving. Lol.",
                                                                  "timestamp": "2022-10-08 22:16:01",
                                                                  "score": 2,
                                                                  "num_children": 1,
                                                                  "author": 385720,
                                                                  "replies": [
                                                                    {
                                                                      "id": "irkavki",
                                                                      "text": "Lmao you are the dumbest person I’ve ever argued with online seriously. If you can actually explain the point you are trying to make I will back down and admit I’m wrong.",
                                                                      "timestamp": "2022-10-08 22:18:49",
                                                                      "score": 1,
                                                                      "num_children": 1,
                                                                      "author": 309124,
                                                                      "replies": [
                                                                        {
                                                                          "id": "irkd0wx",
                                                                          "text": "Calling me names? Zero harm coming from you. Don’t care what you think lol. Just admit you’re a feminist and stand behind the phrase “believe all women” lol.",
                                                                          "timestamp": "2022-10-08 22:35:52",
                                                                          "score": 2,
                                                                          "num_children": 1,
                                                                          "author": 385720,
                                                                          "replies": [
                                                                            {
                                                                              "id": "irkd9b4",
                                                                              "text": "I will proudly admit to be a feminist any time. People who don’t believe that women and men should be equal aren’t worth talking too very much.",
                                                                              "timestamp": "2022-10-08 22:37:44",
                                                                              "score": 1,
                                                                              "num_children": 1,
                                                                              "author": 309124,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "irke9yn",
                                                                                  "text": "See that’s the prob w feminism. You think we’re naive enough to believe its about equality. Its not. Its about female superiority. Its disingenuous at its core and ill be LOL when world finally wakes up and realizes its all a farce.",
                                                                                  "timestamp": "2022-10-08 22:45:53",
                                                                                  "score": 2,
                                                                                  "num_children": 1,
                                                                                  "author": 385720,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "irkekit",
                                                                                      "text": "Make logical argument -> 👎\n\nGo on rant about women oppressing men because you’ve never been able to get laid -> 👍",
                                                                                      "timestamp": "2022-10-08 22:48:10",
                                                                                      "score": 1,
                                                                                      "num_children": 1,
                                                                                      "author": 309124,
                                                                                      "replies": [
                                                                                        {
                                                                                          "id": "irkg80v",
                                                                                          "text": "Typical feminist. Can’t prove your point, resort to insults and personal attacks. Go be triggered on a feminist sub. Nice try.",
                                                                                          "timestamp": "2022-10-08 23:01:24",
                                                                                          "score": 2,
                                                                                          "num_children": 1,
                                                                                          "author": 385720,
                                                                                          "replies": [
                                                                                            {
                                                                                              "id": "irkgebm",
                                                                                              "text": "I’ll I’ve said on this whole thread is ask you to explain your point and you haven’t been able to do so. I never even had a point I was arguing lmao.",
                                                                                              "timestamp": "2022-10-08 23:02:50",
                                                                                              "score": 1,
                                                                                              "num_children": 1,
                                                                                              "author": 309124,
                                                                                              "replies": [
                                                                                                {
                                                                                                  "id": "irkh4v2",
                                                                                                  "text": "Doesn’t even matter anymore. You’re exposed. That’s all that matters.",
                                                                                                  "timestamp": "2022-10-08 23:08:52",
                                                                                                  "score": 2,
                                                                                                  "num_children": 1,
                                                                                                  "author": 385720,
                                                                                                  "replies": [
                                                                                                    {
                                                                                                      "id": "irkhd9n",
                                                                                                      "text": "Lol it’s funny cause you’re doing exactly what you accused me of. You can’t explain your stupid point so you ressort to calling me a feminist as an insult. Except I’m just not insulted by itx",
                                                                                                      "timestamp": "2022-10-08 23:10:45",
                                                                                                      "score": 1,
                                                                                                      "num_children": 1,
                                                                                                      "author": 309124,
                                                                                                      "replies": [
                                                                                                        {
                                                                                                          "id": "irki9t6",
                                                                                                          "text": "Its “resort”. You called yourself a feminist! On an anti-feminist thread no less…",
                                                                                                          "timestamp": "2022-10-08 23:18:16",
                                                                                                          "score": 2,
                                                                                                          "num_children": 1,
                                                                                                          "author": 385720,
                                                                                                          "replies": [
                                                                                                            {
                                                                                                              "id": "irkiobb",
                                                                                                              "text": "I’m not calling myself a feminist I am a feminist. You act like it’s an insult but it’s really jsut cause you hate women. And you still haven’t been able to explain your stupid generalization lmao",
                                                                                                              "timestamp": "2022-10-08 23:21:32",
                                                                                                              "score": 1,
                                                                                                              "num_children": 1,
                                                                                                              "author": 309124,
                                                                                                              "replies": [
                                                                                                                {
                                                                                                                  "id": "irl9u0j",
                                                                                                                  "text": "Im not even mad, you’re the one who’s mad",
                                                                                                                  "timestamp": "2022-10-09 03:04:35",
                                                                                                                  "score": 2,
                                                                                                                  "num_children": 0,
                                                                                                                  "author": 385720,
                                                                                                                  "replies": []
                                                                                                                }
                                                                                                              ]
                                                                                                            }
                                                                                                          ]
                                                                                                        }
                                                                                                      ]
                                                                                                    }
                                                                                                  ]
                                                                                                }
                                                                                              ]
                                                                                            }
                                                                                          ]
                                                                                        }
                                                                                      ]
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "irj6pzp",
              "text": "Women aren't a monolith.",
              "timestamp": "2022-10-08 17:00:47",
              "score": 2,
              "num_children": 1,
              "author": 364622,
              "replies": [
                {
                  "id": "irj9lz9",
                  "text": "Maybe, however, they’re more likely to engage in groupthink and follow trends, than go against popular opinion.",
                  "timestamp": "2022-10-08 17:23:26",
                  "score": 1,
                  "num_children": 1,
                  "author": 385720,
                  "replies": [
                    {
                      "id": "irjvgjb",
                      "text": "I think most people do this regardless of the sex, though women tend to do this more than men; but I don't think it's so much of a thing in psychological issues such as this. People are generally either for and against ″sex work″.\n\nMy point however was that you can't treat women as a one unit, they aren't a hivemind and are capable and do possess individual thought.",
                      "timestamp": "2022-10-08 20:19:56",
                      "score": 1,
                      "num_children": 1,
                      "author": 364622,
                      "replies": [
                        {
                          "id": "irjxaph",
                          "text": "They aren’t a hive mind.\n\nI said “women” (in general). That doesn’t mean ALL women. There’s a difference. Topics such as these are couched in generality because absolutes are not possible.",
                          "timestamp": "2022-10-08 20:33:50",
                          "score": 2,
                          "num_children": 1,
                          "author": 385720,
                          "replies": [
                            {
                              "id": "irkenx4",
                              "text": "Okay that's fine. But you didn't mention ″in general″ even if you meant it, so that's why I responded the way I did. Though, it's pointless making such a point in general for good issue. I don't see how women contradict themselves with their views on this issue in general.",
                              "timestamp": "2022-10-08 22:48:53",
                              "score": 1,
                              "num_children": 0,
                              "author": 364622,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "irgepk6",
          "text": "Classic Orwellian double speak",
          "timestamp": "2022-10-07 22:24:01",
          "score": 24,
          "num_children": 0,
          "author": 317142,
          "replies": []
        },
        {
          "id": "irgiu5l",
          "text": "The reality changes based on the need of the current argument being made.",
          "timestamp": "2022-10-07 23:00:10",
          "score": 35,
          "num_children": 0,
          "author": 119720,
          "replies": []
        },
        {
          "id": "irgle0c",
          "text": "When you're a feminist, you can have I both ways. That's the beauty of it. No matter what you do, it's a man's fault.",
          "timestamp": "2022-10-07 23:23:22",
          "score": 30,
          "num_children": 0,
          "author": 196342,
          "replies": []
        },
        {
          "id": "irgyxko",
          "text": "Yeah, it's interesting because sex work was supposed to be this \"empowering\" thing, right?",
          "timestamp": "2022-10-08 01:29:30",
          "score": 11,
          "num_children": 0,
          "author": 243776,
          "replies": []
        }
      ]
    },
    {
      "id": "irgjvao",
      "text": "So by her logic, by working my job I can now have a viewpoint (as a white cis male) on slavery. I mean, since the money acts as a form of force.",
      "timestamp": "2022-10-07 23:09:26",
      "score": 22,
      "num_children": 1,
      "author": 78805,
      "replies": [
        {
          "id": "irgsqzw",
          "text": "Communists call that wage slavery",
          "timestamp": "2022-10-08 00:31:55",
          "score": 9,
          "num_children": 0,
          "author": 396688,
          "replies": []
        }
      ]
    },
    {
      "id": "irgek2m",
      "text": "If these types of women spent all that time becoming astrophysicists instead of all that mental gymnastics, they’d be able to to develop a way to create a laser beam and tattoo “fuck men” onto the face of the moon for men to see. Sweet Jesus",
      "timestamp": "2022-10-07 22:22:40",
      "score": 35,
      "num_children": 1,
      "author": 126225,
      "replies": [
        {
          "id": "irgjvre",
          "text": "Happy cake day",
          "timestamp": "2022-10-07 23:09:32",
          "score": 4,
          "num_children": 1,
          "author": 273161,
          "replies": [
            {
              "id": "irgq3mj",
              "text": "Thank you",
              "timestamp": "2022-10-08 00:07:14",
              "score": 3,
              "num_children": 2,
              "author": 126225,
              "replies": [
                {
                  "id": "irgvj9f",
                  "text": "yes happy cake day",
                  "timestamp": "2022-10-08 00:57:38",
                  "score": 2,
                  "num_children": 0,
                  "author": 53089,
                  "replies": []
                },
                {
                  "id": "irh7fm3",
                  "text": "happy cake day! happy year 3 on reddit!",
                  "timestamp": "2022-10-08 02:50:59",
                  "score": 1,
                  "num_children": 0,
                  "author": 179153,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "irgg2ze",
      "text": "Yet the Lefties will say if prostitution is illegal, that's attacking women from making and income and taking away their power.\n\nIf they cannot eat all the cake, and still own all the cake, they lose their minds.",
      "timestamp": "2022-10-07 22:35:59",
      "score": 16,
      "num_children": 1,
      "author": 272467,
      "replies": [
        {
          "id": "irgxsu2",
          "text": "They also have to try to keep others from making, or in this case, buying cake. \n\nIt's only okay when feminists do it lol",
          "timestamp": "2022-10-08 01:18:46",
          "score": 6,
          "num_children": 0,
          "author": 62540,
          "replies": []
        }
      ]
    },
    {
      "id": "irhk0g4",
      "text": " We pay bills and taxes that otherwise we would never pay. It clearly acts like extortion.",
      "timestamp": "2022-10-08 05:16:18",
      "score": 5,
      "num_children": 0,
      "author": 261064,
      "replies": []
    },
    {
      "id": "irhryg2",
      "text": "So.... gold digging is prostitution according to them, but they ain't stopping that anyways.",
      "timestamp": "2022-10-08 07:11:05",
      "score": 6,
      "num_children": 0,
      "author": 367412,
      "replies": []
    },
    {
      "id": "irhrzx3",
      "text": "If mental gymnastics was an Olympic sport, most feminists would be setting new world records on a daily basis.",
      "timestamp": "2022-10-08 07:11:42",
      "score": 5,
      "num_children": 0,
      "author": 23671,
      "replies": []
    },
    {
      "id": "irgrgm6",
      "text": "But she alone made the choice to accept money for sex. Offering money doesn't automatically coerce anybody into anything.",
      "timestamp": "2022-10-08 00:19:54",
      "score": 13,
      "num_children": 0,
      "author": 131368,
      "replies": []
    },
    {
      "id": "irgsgd8",
      "text": "Money is the lubricant",
      "timestamp": "2022-10-08 00:29:11",
      "score": 3,
      "num_children": 0,
      "author": 163533,
      "replies": []
    },
    {
      "id": "irifcul",
      "text": "Well they have the choice. Don't do it.simple.",
      "timestamp": "2022-10-08 12:59:21",
      "score": 5,
      "num_children": 0,
      "author": 97268,
      "replies": []
    },
    {
      "id": "irgkvsi",
      "text": "Running straight into the point and still missing it...",
      "timestamp": "2022-10-07 23:18:43",
      "score": 11,
      "num_children": 0,
      "author": 235441,
      "replies": []
    },
    {
      "id": "irixu5b",
      "text": "brilliant mind, this woman",
      "timestamp": "2022-10-08 15:49:22",
      "score": 3,
      "num_children": 0,
      "author": 153989,
      "replies": []
    },
    {
      "id": "irh6nss",
      "text": "I hate how normalized sex work is. I’m considered sexist by a lot of people because I don’t want my future kids ending up as sex workers working under sexist people who treat them like objects.",
      "timestamp": "2022-10-08 02:43:24",
      "score": 6,
      "num_children": 0,
      "author": 113393,
      "replies": []
    },
    {
      "id": "irhaf7l",
      "text": "She doesn't understand consent herself.  That Money is consent.  She can say no and give back the money or not accept.  Getting a woman to give consent isn't some magic spectacle, a lot of women are giving it out like holloween candy cause as it happens women like and want sex also.  Woah!!  And, guess what?  Women also get horny too!  And, in the heat of the moment many women have consensual sex with men they wouldn't have sex with who are not their types at all if it werent for biology.  So, is having sex when a woman is horny rape?",
      "timestamp": "2022-10-08 03:21:34",
      "score": 5,
      "num_children": 0,
      "author": 324647,
      "replies": []
    },
    {
      "id": "irht24z",
      "text": "This logic implies employers are practicing slavery and money is just the method they use for force.",
      "timestamp": "2022-10-08 07:27:56",
      "score": 2,
      "num_children": 0,
      "author": 111717,
      "replies": []
    },
    {
      "id": "irmhg1s",
      "text": "probably she wants johns gets punished, not wh—res bc she wants us to believe that wh—res are rape victims.\n\nshe also wants to convince society there is systemic rape as prostitution and patriarchy…\n\nin reality, almost all prostitution in the west occurs with consent of women who want to avoid real work. The west is not patriarchal but gynocentric.\n\nBut there are serious issues exploitation of men by wh—res like on OF, twitch etc. bc men’s loneliness. they are being manipulated, abused and exploited, a real problem …",
      "timestamp": "2022-10-09 11:53:51",
      "score": 2,
      "num_children": 0,
      "author": 131050,
      "replies": []
    },
    {
      "id": "iro8e0l",
      "text": "\"As a sex worker, I get raped by my need for money.\"",
      "timestamp": "2022-10-09 19:35:57",
      "score": 2,
      "num_children": 0,
      "author": 323702,
      "replies": []
    },
    {
      "id": "irhr4vs",
      "text": "Are you kidding me, this shit had retweets? Feminism needs to get a grip, wasn't sex work \"eMpOweRiNg\" like two mins ago? Now it's rape?",
      "timestamp": "2022-10-08 06:58:51",
      "score": 2,
      "num_children": 0,
      "author": 144324,
      "replies": []
    },
    {
      "id": "irikjzj",
      "text": "Ah okay… so she’s saying women don’t have agency over their bodies, decisions and lives… that old school Saudi Arabia society had it right with the male family guardian thing (I’ve pulled this before in a prostitution is rape discussion and holy crap did the ladies blow a fuse… couldn’t make a valid counterpoint so reverted to hysterics)",
      "timestamp": "2022-10-08 13:52:05",
      "score": 2,
      "num_children": 0,
      "author": 72416,
      "replies": []
    },
    {
      "id": "iri07fe",
      "text": "raped by the patriarchy durr",
      "timestamp": "2022-10-08 09:27:03",
      "score": 1,
      "num_children": 0,
      "author": 266154,
      "replies": []
    },
    {
      "id": "iri80px",
      "text": "Damn these feminist are reaching",
      "timestamp": "2022-10-08 11:30:33",
      "score": 1,
      "num_children": 0,
      "author": 261172,
      "replies": []
    },
    {
      "id": "irgl6tp",
      "text": "The original comment is a bit much, but the counterpoint isn’t much of a counter. \n\nIt’s not like workers are stoked to be making your coffee, they just need a paycheck to survive.",
      "timestamp": "2022-10-07 23:21:30",
      "score": -3,
      "num_children": 2,
      "author": 193390,
      "replies": [
        {
          "id": "irgsrra",
          "text": "Same with prostitutes.\n\nThey probably don't wanna fuck, they just want the money",
          "timestamp": "2022-10-08 00:32:07",
          "score": 8,
          "num_children": 0,
          "author": 343387,
          "replies": []
        },
        {
          "id": "irgt0ah",
          "text": "The consumer is villified for sex but not for coffee. If there's no pimp/employer, then even by leftist logic there's no one getting hurt",
          "timestamp": "2022-10-08 00:34:18",
          "score": 7,
          "num_children": 1,
          "author": 396688,
          "replies": [
            {
              "id": "iri0ev3",
              "text": "jesus christ just attack the capitalist elite already",
              "timestamp": "2022-10-08 09:30:35",
              "score": 1,
              "num_children": 0,
              "author": 266154,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "irilx8s",
      "text": "She's not 100% wrong and I don't see how what she's saying has anything to do with feminism",
      "timestamp": "2022-10-08 14:05:23",
      "score": -4,
      "num_children": 1,
      "author": 254189,
      "replies": [
        {
          "id": "iro8m6f",
          "text": "Because it's bad logic about real issues women face, which is often associated with a lot of SJW feminists.",
          "timestamp": "2022-10-09 19:37:25",
          "score": 1,
          "num_children": 1,
          "author": 323702,
          "replies": [
            {
              "id": "iro8smn",
              "text": "It's really not bad logic at all",
              "timestamp": "2022-10-09 19:38:37",
              "score": 1,
              "num_children": 1,
              "author": 254189,
              "replies": [
                {
                  "id": "iro9524",
                  "text": "\"Because you work a job that involves sex with men you normally wouldn't sleep with, you're being raped by your need for money.\"",
                  "timestamp": "2022-10-09 19:40:51",
                  "score": 1,
                  "num_children": 1,
                  "author": 323702,
                  "replies": [
                    {
                      "id": "iro9uqx",
                      "text": "Yeah , pretty much . I said not a 100% of the time but there are women who prostitute themselves out of desperation like drug addiction and sleeping with them is taking advantage of someone in a desperate situation.  One that feels like life or death . I support women being part of the sex industry, even prostitution but not incases of addiction or other desperate situations and sleeping with them is taking advantage of that and their situation.",
                      "timestamp": "2022-10-09 19:45:26",
                      "score": 1,
                      "num_children": 1,
                      "author": 254189,
                      "replies": [
                        {
                          "id": "iroa9pk",
                          "text": "Oh, okay. I thought we were all talking about legal prostitution/regular sex work where the women is in control of what she does with her body, since money is in mention.",
                          "timestamp": "2022-10-09 19:48:09",
                          "score": 1,
                          "num_children": 1,
                          "author": 323702,
                          "replies": [
                            {
                              "id": "iroahin",
                              "text": "The woman quoted probably is but I'm not . It's not black and white for me",
                              "timestamp": "2022-10-09 19:49:31",
                              "score": 1,
                              "num_children": 0,
                              "author": 254189,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "irk1uho",
      "text": "There’s a lot of men in these comments clearly mad because they can’t get any sex without paying for it lmao",
      "timestamp": "2022-10-08 21:08:18",
      "score": 0,
      "num_children": 0,
      "author": 309124,
      "replies": []
    },
    {
      "id": "irhy6rp",
      "text": "Just for the record, Catherine MacKinnon, who ever she is, knows exactly what she's doing.... stirring!",
      "timestamp": "2022-10-08 08:52:31",
      "score": 1,
      "num_children": 0,
      "author": 39134,
      "replies": []
    },
    {
      "id": "irijtsa",
      "text": "Prostitution is still a job, still a hard one. But yeah that chick is on crack, no one wants to work, that doesn’t make it rape.",
      "timestamp": "2022-10-08 13:44:56",
      "score": 1,
      "num_children": 0,
      "author": 273881,
      "replies": []
    },
    {
      "id": "irmbmc5",
      "text": "Don't laugh, Coffee rape is not a joke Jim, Millions of coffee workers suffer every year",
      "timestamp": "2022-10-09 10:39:52",
      "score": 1,
      "num_children": 0,
      "author": 188025,
      "replies": []
    },
    {
      "id": "ism15e2",
      "text": "Most modern feminists are pro-sex work",
      "timestamp": "2022-10-17 00:02:10",
      "score": 1,
      "num_children": 0,
      "author": 60287,
      "replies": []
    },
    {
      "id": "irjnryq",
      "text": "Prostitution is a really vicious thing because there is a lot of violence from it, women (and men) traumatised by it. It's absolutely heart breaking. Then we have the nymphomaniacs that have enough money and a good situation to stop whenever they want unlike the women that were forced in it. So yeah, its either way hurt women or nymphomaniac that think prostitution is empowering.",
      "timestamp": "2022-10-08 19:17:29",
      "score": 0,
      "num_children": 0,
      "author": 200588,
      "replies": []
    }
  ]
}